{
  "Count": 57,
  "Message": "Results returned successfully",
  "Results": [
    {
      "ODINumber": 11310000,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1559016000000-0400)/",
      "DateComplaintFiled": "/Date(1582084345000-0500)/",
      "VIN": "WAUEFAFL5AN",
      "Component": "ENGINE",
      "Summary": "I WAS DRIVING MY CAR FROM WORK ON A CITY STREET I HEARD THAT IT WAS KNOCKING AND HAD STOPPED THE CAR TO CHECK ON IT BUT WAS NOT SURE SINCE I AM FIGURING THIS CAR OUT. AFTER THAT DAY IT HAD BEEN KNOCKING. A FEW DAYS LATER IT HAD STARTING TO SHAKE WHILE I WAS DRIVING AND ALL THIS HAPPENED ON A CITY STREET. BUT ANYWAYS WHEN I ACCELERATED TO A CERTAIN NUMBER, THE SHAKING STOPPED BUT WAS STILL KNOCKING. AND AFTER TIME IT JUST GOT WORSE AND WAS UNSAFE TO DRIVE.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10299869,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1263531600000-0500)/",
      "DateComplaintFiled": "/Date(1263531600000-0500)/",
      "VIN": "WAUBFAFLXAA",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "THE 2010 AUDI A4 2.0T WHICH I LEASED LUNGES FORWARD EVERY TIME IT IS DOWN SHIFTED IN TRIPTRONIC MODE (MANUALLY SHIFTING THE AUTOMATIC TRANSMISSION).  TODAY, I REPORTED THE DEFECT TO THE SERVICE WRITER SCOTT SUMMERFIELD AT MCDONALD AUDI IN LITTLETON  CO AND HE TOLD ME HE WAS AWARE OF IT AND THAT HE THOUGHT AUDI MIGHT BE WORKING ON A \"FIX\" FOR IT.  I THINK YOU SHOULD COMPEL AUDI TO REPLACE THE TRANSMISSIONS BECAUSE THE LUNGING IS A POTENTIALLY LIFE THREATENING DEFECT.  THE MANUAL SHIFTING MODE OF THE AUTOMATIC TRANSMISSION IS USED MAINLY ON UNSAFE STEEP MOUNTAIN ROADS TO AVOID RIDING THE BRAKE ON A DOWNHILL GRADE AND TO ACQUIRE GREATER CONTROL OF THE VEHICLE ON SLIPPERY TERRAIN WHERE THE POSSIBILITY OF A FATAL ACCIDENT SUCH AS GOING OVER A CLIFF IS GREAT. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10308287,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1262322000000-0500)/",
      "DateComplaintFiled": "/Date(1265778000000-0500)/",
      "VIN": "WAUEFAFL4AN",
      "Component": "FUEL SYSTEM, GASOLINE",
      "Summary": "2010 AUDI A4 2.0T HAS A SERIOUS LAG PROBLEM WHICH LEADS TO ACCELERATION SURGE ESPECIALLY WHEN MAKING TURNS.  IT IS DIFFICULT TO CONTROL. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10332421,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1268370000000-0500)/",
      "DateComplaintFiled": "/Date(1274846400000-0400)/",
      "VIN": "WAUMGAFL8AA",
      "Component": "ENGINE AND ENGINE COOLING:COOLING SYSTEM",
      "Summary": "2010 AUDI S4 NEW VEHICLE WITH 5,200 MILES DRIVING ON INTERSTATE AND PASSING A CAR WHEN WATERPUMP FAILED.  CAR WAS TOWED TO DEALERSHIP AND REPAIRED. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10334666,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1275278400000-0400)/",
      "DateComplaintFiled": "/Date(1275624000000-0400)/",
      "VIN": "WAUBGAFL9AA",
      "Component": "ENGINE AND ENGINE COOLING:COOLING SYSTEM",
      "Summary": "DAMAGE TO SECONDARY RADIATOR CAUSED COOLANT LEAK. SECONDARY RADIATOR IS NOT SUFFICIENTLY SHIELDED OR PROTECTED FROM DEBRIS. THERE WAS NO VISIBLE DEBRIS ON THE ROAD LEADING ME TO BELIEVE SOMETHING AS MASSLESS AS A LARGE BUG COULD HAVE CAUSED THE DAMAGE. CAR WAS TOWED TO DEALER AND REPAIRED. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10334698,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1272686400000-0400)/",
      "DateComplaintFiled": "/Date(1275710400000-0400)/",
      "VIN": "WAUAFAFL7AN",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "I HAVE A 2010 AUDI A4 WITH THE \"MULTITRONIC\" CVT TRANSMISSION. WHEN THE VEHICLE IS ON AN INCLINE, THE CAR ROLLS-BACK (OR FORWARD) WHEN IN DRIVE, MUCH LIKE A CAR WITH A MANUAL TRANSMISSION. I HAVE TAKEN THE CAR IN FOR SERVICE AND WAS TOLD THAT THIS BEHAVIOR IS \"NORMAL\" AND FUNCTIONING \"AS DESIGNED.\"\r\n\r\nWHILE THIS HAS NOT CAUSED AN ACCIDENT, THIS SORT OF BEHAVIOR HAS THE POTENTIAL TO CAUSE COLLISIONS WITH THE CAR BEHIND (OR IN FRONT) WHEN ON AN INCLINE, GRADE, HILL, PARKING GARAGE, PARKING LOT, ETC. THIS BEHAVIOR HAS CAUSE FRIGHTENING SITUATIONS IN WHICH I'VE HAD TO SLAM ON THE BRAKES FOR FEAR OF HITTING THE CAR BEHIND (OR IN FRONT) OF ME. THIS HAS ALSO CAUSED THE DRIVER OF THE OTHER VEHICLE TO HONK IN FEAR OF GETTING HIT.\r\n\r\nI HAVE NOT OBSERVED SIMILAR BEHAVIOR IN VEHICLES WITH TRADITIONAL MANUAL OR AUTOMATIC TRANSMISSIONS. THIS BEHAVIOR SEEMS TO BE LIMITED TO AUDIS WITH CVT TRANSMISSIONS. I HAVE BEEN ABLE TO REPRODUCE THE SAME BEHAVIOR ON A FRIEND'S 2009 AUDI A4 WITH THE SAME TRANSMISSION. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10352848,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1277956800000-0400)/",
      "DateComplaintFiled": "/Date(1283140800000-0400)/",
      "Component": "ENGINE AND ENGINE COOLING",
      "Summary": "THERE IS A FOUL ODOR FROM THE HEAT/AC VENTS AFTER ONLY 4 MONTHS OF USE. THE CAR IS CLEAN FROM HEAD TO TOE SO I COULDN'T FIGURE OUT WHAT COULD HAVE CAUSED THE SMELL. I TOOK IT IN TO BE SERVICED AND THEY PREFORMED A TSB TO REMOVE THE ODOR. IT THEN SMELLED LIKE A MUSKY LEMON. A MONTH LATER THE FOUL ODOR IS BACK, NOT SURE WHAT IS CAUSING IT BUT NOT VERY PLEASED WITH THE BRAND NEW FUNK AROMA. I'M GOING TO HAVE TO TAKE IT BACK IN AGAIN. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10360101,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1284782400000-0400)/",
      "DateComplaintFiled": "/Date(1286856000000-0400)/",
      "VIN": "WAUKFAFLXAN",
      "Component": "ENGINE AND ENGINE COOLING:ENGINE",
      "Summary": "TL* THE CONTACT OWNS A 2010 AUDI A4. THE CONTACT STATED THAT WHILE DRIVING 10 MPH AND MAKING A TURN, THE VEHCLE LOST POWER. THE CONTACT DEPRESSED THE ACCELERATOR PEDAL AND THE VEHICLE BEGAN TO FUNCTION PROPERLY. THE CONTACT CALLED THE DEALER WHO STATED THAT THEY WERE AWARE OF THE PROBLEM. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 3,000 AND THE CURRENT MILEAGE WAS APPROXIMATELY 7,500.\r\n\r\n",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10367246,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1290402000000-0500)/",
      "DateComplaintFiled": "/Date(1290488400000-0500)/",
      "Component": "ENGINE AND ENGINE COOLING",
      "Summary": "TL*THE CONTACT OWNS A 2010 AUDI A4.  WHILE DRIVING APPROXIMATELY 30 MPH THE CHECK ENGINE LIGHT ILLUMINATED ON THE DASHBOARD. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE SHE WAS INFORMED THAT THE VEHICLE WAS BURNING OIL VERY FAST.  SHE WAS ALSO INFORMED THAT THIS WAS A NORMAL OCCURRENCE FOR THIS TYPE OF VEHICLE.  THE VEHICLE WAS NOT REPAIRED BUT SHE WAS ADVISED TO CHECK THE OIL EVERY 300 MILES.  THE FAILURE AND CURRENT MILEAGES WERE 4,800.  THE VIN WAS UNAVAILABLE.  ",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10371399,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1292302800000-0500)/",
      "DateComplaintFiled": "/Date(1292355746000-0500)/",
      "VIN": "WAUSFAFL0AA",
      "Component": "ENGINE AND ENGINE COOLING | FUEL SYSTEM, GASOLINE",
      "Summary": "FUEL INJECTOR FAILS, CAR SPUTTERS, STALLS.  SMOKE VISIBLE. ONCE FUEL WAS SEEN EXITING EXHAUST. HAS OCCURRED TWICE.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10382793,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1281499200000-0400)/",
      "DateComplaintFiled": "/Date(1297746000000-0500)/",
      "VIN": "WAUDFAFL8AN",
      "Component": "VISIBILITY:WINDSHIELD WIPER/WASHER",
      "Summary": "TL*THE CONTACT OWNS A 2010 AUDI A4 QUATTRO.  THE CONTACT STATED THAT THE MANUAL WINDSHIELD WIPERS SHUT OFF WHEN THE VEHICLE CAME TO A STOP WHICH WAS ALSO LISTED IN THE OWNERS MANUAL. THE DEALER SPOKE WITH THE MANUFACTURER AND WAS TOLD THAT THIS WAS HOW THE VEHICLE WAS DESIGNED AND THERE WAS NO OVERRIDE OR UPGRADE AT THIS TIME. THE FAILURE MILEAGE WAS 5,000 AND THE CURRENT MILEAGE WAS 15,000.     UPDATED 3/21/11 *CN\r\nUPDATED 08/04/11",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10407141,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1301716800000-0400)/",
      "DateComplaintFiled": "/Date(1308196800000-0400)/",
      "VIN": "WAUWFAFL8AA",
      "Component": "ENGINE AND ENGINE COOLING",
      "Summary": "TL* THE CONTACT OWNS A 2010 AUDI A4.  THE CONTACT WAS DRIVING 50 MPH WHEN THE VEHICLE STALLED WITHOUT WARNING.  THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTICS BUT THE DEALER COULD NOT DUPLICATE THE FAILURE.  THE CONTACT WAS CONCERNED WITH THE POTENTIAL SAFETY HAZARD INVOLVED WITH THE VEHICLE STALLING AND POSSIBLY CAUSING A CRASH.  THE FAILURE MILEAGE WAS 5,800.   ",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10413792,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1310011200000-0400)/",
      "DateComplaintFiled": "/Date(1311134400000-0400)/",
      "VIN": "WAUFFAFL5AN",
      "Component": "ENGINE AND ENGINE COOLING:ENGINE | POWER TRAIN:AUTOMATIC TRANSMISSION | VEHICLE SPEED CONTROL",
      "Summary": "DRIVING TO WORK ON A COUNTRY ROADWAY, PASSED A VEHICLE AND BEGAN TO PULL BACK INTO MY LANE, RELEASING THE GAS PEDAL, BUT THE AUDI 2010 A4 CONTINUED TO ACCELERATE EVEN AFTER BRAKING, SPEEDS IN EXCESS OF 85-90 MPH.  BRAKES FUNCTIONED, PULLED OVER, STOPPED CAR.  LOOKED DOWN, NOTHING INTERFERING WITH THE GAS PEDAL.  RESTARTED CAR, SPEEDOMETER NEEDLE JUMPED TO 7000-8000 RPM, CAR REVVED.  NEEDED TO GET THE CAR TO A SAFE LOCATION, PROCEEDED TO DRIVE DOWN THE ROAD WITH THE BRAKE PEDAL DEPRESSED, BRAKES BEGAN SMOKING BUT MADE IT TO A MINI MART, PARKED AND STOPPED CAR.  CAR TOWED TO DEALERSHIP, DEALERSHIP SAID THERE WAS NOTHING WRONG WITH THE CAR.  CONTACTED AUDI OF AMERICA, THEY REVIEWED THE RECORDS AND SAID THAT THERE WAS NOTHING WRONG WITH THE CAR.  VEHICLE ACCELERATED TO HIGH RATE OF SPEED DESPITE DRIVER'S ATTEMPTS TO REDUCE SPEED.  HAVE NOT DRIVEN VEHICLE SINCE THIS INCIDENT ON 7/7/11.  NO PRIOR PROBLEMS, BUT SINCE I STOPPED THE VEHICLE AND LOOKED DOWN AT THE GAS PEDAL, THERE WAS NOTHING IN THE WAY WHICH WOULD HAVE CAUSED THE VEHICLE TO ACCELERATE.  DEALERSHIP STATES NO CODES WERE THROWN AND NOTHING SHOWS UP.  *KB",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10496017,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1357880400000-0500)/",
      "DateComplaintFiled": "/Date(1359608400000-0500)/",
      "VIN": "WAUHFBFL2AN",
      "Component": "ENGINE | FUEL/PROPULSION SYSTEM",
      "Summary": "CAR BROUGHT IN FOR MISFIRE CONDITION THAT RESULTED IN POWER REDUCTION/HESITATION WHILE DRIVING.  DEALER DETECTED FAULTY INJECTOR.  REPLACED INJECTOR AND ENGINE WAS STILL MALFUNCTIONING.  DEALER THEN REMOVED CYLINDER AND OBSERVED PISTON RINGLAND DAMAGE.  VEHICLE WAS STARTING TO EXHIBIT EXCESSIVE OIL CONSUMPTION PROBLEMS.  EITHER FAULTY INJECTOR OR PISTON RING DEFECT IS SUSPECTED TO CAUSE DAMAGE.  LOOKING INTO REMEDIES THROUGH ARBITRATION OR OTHER MEANS AS AUDI IS AWARE ABOUT (I.E. UNDERSIZED RINGS / PISTONS).  I WILL RETAIN ALL SUSPECT PARTS AS AUDI WILL NOT HONOR UNDER WARRANTY TERMS AND INDEPENDENT SHOP WILL BE PERFORMING REPAIRS, AND CAN BE MADE AVAILABLE FOR FURTHER INVESTIGATION.  \r\n\r\nEXCESSIVE OIL CONSUMPTION IS A KNOWN ISSUE WITH AUDI USA.  THE MANUAL STATES THAT NORMAL CONSUMPTION IS UP TO 1 QUART FOR EVERY 1000 MILES.  PER AUDI'S RECOMMENDATIONS, YOU WILL BURN 10 QUARTS OF OIL BEFORE YOU NEED AN OIL CHANGE.  THAT ENGINE HOLDS 5 QUARTS WHEN NOT LEAKING IT THROUGH RINGS, REDUCING ANTI-KNOCK RATING OF FUEL DURING COMBUSTION. \r\n\r\nI BELIEVE THIS A SIGNIFICANT SAFETY HAZARD AS ENGINE SEIZING COULD UNEXPECTEDLY OCCUR DUE TO DEFECTIVE COMPONENTS.   I BELIEVE A CLASS ACTION LAWSUIT IS INEVITABLE.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10496522,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1360040400000-0500)/",
      "DateComplaintFiled": "/Date(1360040400000-0500)/",
      "VIN": "WAUHFAFL7AN",
      "Component": "VEHICLE SPEED CONTROL",
      "Summary": "DURING AN ATTEMPT TO ACCELERATE THE GAS PEDAL WAS PUSHED TO THE FLOOR (AUDI A4 '10) AND REMAINED STUCK TO THE FLOOR EVEN AFTER THE FOOT WAS REMOVED.  THE CAR HAS A MANUAL TRANSMISSION AND WAS SHIFTED INTO NEUTRAL AT THIS TIME.  THE TACHOMETER INDICATED THE ENGINE WAS REDLINING IN NEUTRAL WHILE THE FOOT WAS STILL OFF THE ACCELERATOR PEDAL.  THIS ENGINE SPEED LASTED FOR APPROXIMATELY 5 SECONDS THEN THE ACCELERATOR APPEARED TO BECOME UNSTUCK AND CAR OPERATION RETURNED TO NORMAL.  AN AFTERMARKET FLOOR MAT WAS IN PLACE AT THE TIME OF THE INCIDENT.  HOWEVER, THE MAT WAS \"ZIP TIED\" BACK TO THE DRIVER'S SEAT MOUNT SO IT WOULD NOT SHIFT FORWARD AND POSSIBLY INTERFERE IN CLUTCH, BRAKE OR ACCELERATOR OPERATION.  AFTER THIS INCIDENT, THE SAME DAY, THE DRIVER CHECKED TO MAKE SURE THE FLOOR MAT WAS PROPERLY PLACED AND STILL ZIP TIED AND IT WAS.  THE FLOOR MAT WAS ZIP TIED TO BEGIN WITH BECAUSE THERE WAS ONE OTHER EPISODE OF UNINTENDED ACCELERATION APPROXIMATELY 1 YEAR AGO THAT THE DRIVER THOUGH MAY HAVE BEEN DUE TO SLIPPAGE OF THE FLOOR MAT.  OBVIOUSLY THIS INITIAL EVENT A YEAR AGO COULD HAVE BEEN DUE TO CAUSES OTHER THAN THE FLOOR MAT.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10502276,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1362373200000-0500)/",
      "DateComplaintFiled": "/Date(1362974400000-0400)/",
      "VIN": "WAUAF78E97A",
      "Component": "UNKNOWN OR OTHER",
      "Summary": "SUSPICIOUS VEHICLE LEFT PARKED [XXX]. SINCE MONDAY 3/4/2013. ALL [XXX] DO NOT KNOW OWNER OF CAR. CALLED POLICE WAS TOLD REGISTERED OWNER HAS A ILLINOIS ADDRESS AND MAY BE A COLLEGE STUDENT AT LMU. TOLD ME TO CALL DOT FOR TICKET/TOW IF OWNER OF AUTO DOES NOT APPEAR 78 HOURS. WELL IT'S BEEN 6 DAYS. PLEASE HELP!\r\n\r\nINFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10510569,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1352955600000-0500)/",
      "DateComplaintFiled": "/Date(1367553600000-0400)/",
      "VIN": "WAUEFAFL5AN",
      "Component": "FUEL/PROPULSION SYSTEM | VEHICLE SPEED CONTROL",
      "Summary": "PROBLEM ONE THE CAR WAS BURNING THROUGH A QUART OF EXPENSIVE OIL EVERY 300 MILES. TOOK IT IN,DROPPED THE ENGINE,CHANGED ALL PISTONS,REMOVED CRANKSHAFT OIL SEAL,FAULTY  HIGH MOUNT BRAKE LIGHT,PRESSURE REGULATING VALVE ALL REPLACED. CAR WAS ACCELERATING WITH AND WITHOUT HESITATION,BUT DEALER DUPLICATED THE OCCURRENCE AND SAID THEY FIXED. ONE MONTH LATER,CAR SMELLED LIKE GAS AND WAS TAKING OFF ON IT'S OWN BROUGHT BACK DEALER COULD NOT DUPLICATE. VERY BAD SMELL OF GAS AND RAPID ACCELERATION -DEALER REMOVED ENGINE AGAIN REPLACED ALL VALVES,DIAGNOSIS PURGE VALVE STUCK. SUSPECTED  INJECTOR SEAL.REPLACED 4 INJECTOR SEALS, SMELL PERSISTED.REPLACED INTAKE VALVE,REMOVE AND REPLACE PURGE VALVE ASSEMBLY. PISTONS HAVE ALL BEEN REPLACED,ENGINE HAS BEEN COMPLETELY REMOVED TWICE, AND THE TRANSMISSION IS STILL JUMPING AND THE CAR ACCELERATES BY ITSELF.AUDI REFUSES TO RECOGNIZE THE PROBLEM , I HAVE ONLY 1200 MILES LEFT ON WARRANTY.  I HAVE ONLY HAD THIS CAR 7 MONTHS AND AM AFRAID TO DRIVE BUT AUDI OFFERS NO OPTIONS-I ASKED FOR EXTENDED WARRANTY ON THE ENGINE AND THEY SAID NO. I HAVE THE CAR IN MY POSSESSION WITH THE ACCELERATION ISSUE AND PERIODICALLY SMELLS OF GAS. I DRIVE 3 CHILDREN TO AND FROM .  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10542380,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1358226000000-0500)/",
      "DateComplaintFiled": "/Date(1378539952000-0400)/",
      "VIN": "WAUFFAFL4AN",
      "Component": "ENGINE",
      "Summary": "BOUGHT THE CAR USED FROM A DEALERSHIP THAT INSPECTED THE CAR FOR ANY DEFECTS.  WHILE TEST DRIVING THE CAR, I HAD TO RETURN THE CAR TO THE DEALERSHIP FOR REPAIRS.  THE CARS FUEL PUMP WAS FAILING AND CAUSING EXCESSIVE MISFIRES.  THEN ABOUT TWO MONTHS AFTER DRIVING THE CAR, IT BEGAN TO USE OIL EXCESSIVELY.  I CHECKED FOR ANY LEAKS AND FOUND NONE. I CONTACTED THE DEALERSHIP AND WAS INFORMED THAT ANYTHING LESS THAN 1QT PER 1000 MILES WAS CONSIDERED NORMAL UNDER AUDI STANDARDS.  PERSONALLY I DON'T AGREE!  NOW APPROXIMATELY 20000 MILES LATER AND 8 MONTHS, IT BURNS A QT OF OIL EVERY 300 MILES.  I KNOW THIS IS EXCESSIVE AS I CAN NOW SEE AND SMELL OIL FROM THE EXHAUST.  I CONTACTED AUDI FOR A RESOLUTION SINCE THERE ARE NUMEROUS COMPLAINTS ABOUT THE EXCESSIVE OIL BUT AS EXPECTED, SINCE I DID NOT BUY THE VEHICLE FROM AN AUTHORIZED RESELLER, IT COULDN'T BE COVERED.  IF THE ENGINEERS AT AUDI KNOW SOME OF THE CARS PRODUCED WITH THE 2.0 TURBO ENGINE WERE ASSEMBLED WITH PISTONS AND RINGS THAT WERE TOO SMALL, WHY HASN'T A MASS RECALL BEEN ISSUED TO RESOLVE THE ISSUE?  I WOULD LIKE THIS ISSUE TO BE RESOLVED BEFORE SOMETHING MORE CATASTROPHIC OCCURS.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10558598,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1388984400000-0500)/",
      "DateComplaintFiled": "/Date(1388984400000-0500)/",
      "VIN": "WAUDFAFLXAN",
      "Component": "ENGINE",
      "Summary": "THE OIL WAS CHANGED AT 70,000 MILES.  THE OIL LIGHT CAME ON TWICE AFTER LESS THAN 2,000 MILES.  I ADDED OIL THE FIRST TIME, AND IT'S ON AGAIN AFTER LESS THAN A WEEK.  I CHECKED A FEW FORUMS ON LINE AND OTHER OWNERS HAVE EXPERIENCED THE SAME THING.  THE CAR IS NOT LEAKING OIL, SO I'M FIGURING THE ENGINE MUST BE BURNING OIL.  A FEW MECHANICS I'VE SPOKEN TO HAVE SAID THAT SOME AUDI A4'S HAVE BEEN RECALLED FOR THIS PROBLEM.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10560545,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1389934800000-0500)/",
      "DateComplaintFiled": "/Date(1390107600000-0500)/",
      "VIN": "WAUBFAFL3AN",
      "Component": "ENGINE",
      "Summary": "AUDI CARS CONSUME OIL LIKE CRAZY BUT MY A4 TAKES ONE QUART EVERY 200 MILES AND I COMMUTE EVERYDAY TO DIFFERENT CITY'S FOR WORK AND TO SCHOOL. COME TO FIND OUT THAT I HAVE THE OLD AUDI ENGINE, AND YOU MUST GET THE NEW ONE TO NOT HAVE THIS PROBLEM. SHOULD BE UNDER WARRANTY FROM THE DEALER IF NOT IM GETTING RID OF THE CAR.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10577945,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1371096000000-0400)/",
      "DateComplaintFiled": "/Date(1396843200000-0400)/",
      "Component": "ENGINE",
      "Summary": "TL* THE CONTACT OWNS A 2010 AUDI A4. THE CONTACT STATED WHILE DRIVING 30 MPH, THE ADD 1 QUART OF OIL LIGHT ILLUMINATED. THE CONTACT ADDED A QUART OF OIL TO THE VEHICLE BUT 1,000 MILES LATER, THE LIGHT ILLUMINATED AGAIN. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION AND THEY STATED THAT THE ENGINE HAD THE WRONG PISTONS AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 27,000. THE VIN WAS UNAVAILABLE.  ",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10588566,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1374465600000-0400)/",
      "DateComplaintFiled": "/Date(1400126400000-0400)/",
      "Component": "ENGINE | STEERING",
      "Summary": "I BOUGHT CAR USED FROM AN AUDI DEALER, AND MONTHS LATER THE CAR RATTLED AND THE WHOLE CAR WAS SHAKING WHEN I TURNED IT ON IN THE MORNING. I TURNED IT OFF AND ON AGAIN, THIS STOPPED THE PROBLEM. I THOUGHT IT WAS PROBABLY THE WEATHER OF AROUND 53 DEGREES F. MONTHS LATER IT DID IT AGAIN TWO MORE TIMES BUT THIS TIME THE WEATHER WAS NOT COLD AND I DROVE AN HOUR EARLIER. IN JANUARY OF THIS YEAR, I DROVE 40 MILES AND WHEN PULLING INTO MY DRIVEWAY THE CAR TURNED OFF ON ITS OWN. I COULD NOT POSSIBLY TURNED IT OFF DUE TO BOTH OF MY HANDS WERE ON THE STEERING WHEEL AS I WAS TURNING INTO MY DRIVEWAY. THANKS GOD I WAS DRIVING SLOW BECAUSE MY KIDS WERE OUTSIDE. I CHECKED THE KEY AND IT WAS STILL PUSHED DOWN. MY HUSBAND THAT WAS ALSO OUTSIDE NOTICED WHAT HAPPENED, HE TOLD ME TO TAKE THE CAR TO THE DEALER. I HAD ALREADY TAKEN THIS VEHICLE FOR MAKING NOISE WHEN TURNING. I TOOK THE CAR TO THE DEALER FOR THE CAR TURNING OFF. ONCE THE DEALER WAS DONE TROUBLESHOOTING THEY SAY THAT THERE'S NOTHING WRONG WITH THE CAR.  THEY COULD NOT DUPLICATE THE PROBLEM. I STILL HAVE THIS PROBLEM OF THE ENGINE SOMETIMES SHAKING THE WHOLE CAR WHEN TURNING ON. AND AS FOR MY STEERING I STILL HAVE THE PROBLEM, I PAID FOR NEW TIRES, ALIGNMENT, AND FOR TIRE BALANCE. I REALLY DON'T HAVE TIME TO KEEP TAKING THE CAR TO THE DEALER FOR THEM TO SAY THAT THEY COULD NOT DUPLICATE THE PROBLEM.   *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10593796,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1400817600000-0400)/",
      "DateComplaintFiled": "/Date(1400895435000-0400)/",
      "VIN": "WAUEFAFLXAN",
      "Component": "POWER TRAIN | POWER TRAIN | POWER TRAIN",
      "Summary": "NOTHING ",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10593797,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1400817600000-0400)/",
      "DateComplaintFiled": "/Date(1400895486000-0400)/",
      "VIN": "WAUEFAFLXAN",
      "Component": "POWER TRAIN | POWER TRAIN | POWER TRAIN",
      "Summary": "NOTHING ",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10630903,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1408680000000-0400)/",
      "DateComplaintFiled": "/Date(1409803200000-0400)/",
      "Component": "ENGINE",
      "Summary": "I HAVE AN 2010 AUDI A4. THE VEHICLE STALLED ON THE HIGHWAY WHILE DRIVING AT 60 MPH. THE OIL LIGHT WENT FROM YELLOW TO RED AND THE CAR. I HAD JUST PUT OIL IN THE VEHICLE BEFORE LEAVING THAT MORNING, AND THE VEHICLE IS NOT LEAKING OIL.\r\n\r\nI HAVE COMPLAINED TO THE DEALER AND MANUFACTURER ABOUT THE OIL CONSUMPTION PROBLEM WHICH IS A WELL KNOWN PROBLEM WITH THE 2008-2012 A4 AND A5 MODELS, BUT THE CLAIM IT  IS NOT A SAFETY ISSUE AND HAVE REFUSED TO FIX THE PROBLEM.   *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10640735,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1380600000000-0400)/",
      "DateComplaintFiled": "/Date(1412222400000-0400)/",
      "VIN": "WAUBFAFL1AN",
      "Component": "ENGINE AND ENGINE COOLING | FUEL/PROPULSION SYSTEM",
      "Summary": "THIS CAR CONSUMES OIL AND NEEDS A REFILL EVERY 200 MILES OR LESS.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10678746,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1421643600000-0500)/",
      "DateComplaintFiled": "/Date(1422162000000-0500)/",
      "VIN": "WAUKFAFL9AN",
      "Component": "ENGINE",
      "Summary": "ADD OIL WARNING LIGHT ON. THE CAR TELLS ME TO ADD 1 QUARTS OIL EVERY 200-300 MILES. CAR HAS A KNOWN EXCESSIVE OIL CONSUMPTION ISSUE BECAUSE AUDI MADE BAD BATCH OF PISTON RINGS ON ENGINE CODE CAE AND THEY REFUSE TO ADMIT IT. CLASS ACTION LAWSUIT WAS FILED AGAINST THEM AND WAS SETTLED IN SEPT 2014 AND NOW ITS TIME FOR A RECALL ON THIS ISSUE.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10808307,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1447477200000-0500)/",
      "DateComplaintFiled": "/Date(1449194158000-0500)/",
      "VIN": "WAUAFAFL3AN",
      "Component": "ENGINE | POWER TRAIN",
      "Summary": "PURCHASED A USED LEASE VEHICLE IN 2014, 63,000 MILES ON IT. LOOKED LIKE A CREAMPUFF. CARFAX WAS CLEAN. USED OIL EXCESSIVELY. WAS TOLD BY LOCAL DEALER I COULD NOT GET CAR FIXED PER CLASS ACTION SETTLEMENT BECAUSE I WAS NOT ORIGINAL OWNER OR DID NOT HAVE ALL SERVICE RECORDS. CAR HAS NOW HAD AN INTAKE VALVE FAILURE IN CYLINDER 3 WHILE DRIVING ON HIGHWAY AT NORMAL SPEED. POSSIBLY CAUSED BY DEFECTIVE PISTON RINGS BREAKING. 101,000 MILES AND JUST OUT OF EXTENDED WARRANTY I PURCHASED FOR $2500 EXTRA.  CAR IS NOT DRIVABLE AND STUCK 3 HOURS FROM MY HOME.  AUDI OF AMERICA SAYS CAR WAS \"FIXED\" IN 2012 AND WILL NOT RELEASE MAINTENANCE RECORDS, CITING PRIVACY OF PREVIOUS OWNER, A CORPORATE LEASE. AUDI DEALER IN MELBOURNE FL WHO DID THE REPAIR IN 2012 WILL NOT RELEASE RECORDS SO I DO NOT KNOW WHAT WAS FIXED AND WHAT PARTS WERE USED.  TOTAL RUNAROUND BY AUDI OF AMERICA AND AUDI OF MELBOURNE.  I DON'T HAVE $7000 FOR REPAIR, AND, STILL MAKE PAYMENTS ON CAR FOR 2 MORE YEARS .  A CAR I CAN'T DRIVE, FOR WORK.  ALL 5 MILLION VEHICLES FROM 2009, 2010 AND 2011 WITH DEFECTIVE PISTONS AND RINGS NEED TO BE RECALLED AND FIXED.  EXCESSIVE OIL CONSUMPTION ALSO COMPROMISES CATALYTIC CONVERTER PERFORMANCE, AND LIFE. THAT'S ANOTHER $1200-$1700 TO GET REPLACED.  AUDI CARE IS A JOKE. THEIR ARROGANCE IS ASTOUNDING.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10850822,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1456981200000-0500)/",
      "DateComplaintFiled": "/Date(1458588982000-0400)/",
      "VIN": "WAUBFAFL3AN",
      "Component": "ENGINE",
      "Summary": "THE TIMING CHAIN TENSIONER BROKE CAUSING THE ENGINE TO COMPLETELY STOP WHICH MADE THE CAR UNABLE TO MOVE OR RESPOND IN ANY WAY.  AT THE TIME THE VEHICLE WAS STATIONARY BUT COMPLETELY DISABLED.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11041750,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1508472000000-0400)/",
      "DateComplaintFiled": "/Date(1509481310000-0400)/",
      "VIN": "WAUDFAFL7AN",
      "Component": "ENGINE",
      "Summary": "CATASTROPHIC ENGINE DAMAGE CAUSED BY FAILURE OF TIMING CHAIN TENSIONER.  NO EARLY WARNING AS VEHICLE WAS SERVICED THE DAY BEFORE BY AUDI DEALERSHIP AND OIL CAPACITY AND PRESSURE WERE WITHIN MANUFACTURERS TOLERANCE.  VEHICLE WAS IN MOTION AT SLOW SPEED WHEN CHECK ENGINE LIGHT CAME ON.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11041670,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1509163200000-0400)/",
      "DateComplaintFiled": "/Date(1509472793000-0400)/",
      "VIN": "WAUFFAFL1AN",
      "Component": "ENGINE",
      "Summary": "TIMING CHAIN TENSIONER FAILURE. THE FAILURE CAUSED THE TIMING CHAIN TO JUMP, THROWING THE PISTONS OUT OF SYNC, CAUSING DAMAGE TO THE VALVES. THIS OCCURRED WHEN FIRST STARTING THE VEHICLE.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11052078,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1512104400000-0500)/",
      "DateComplaintFiled": "/Date(1512329270000-0500)/",
      "VIN": "WAUFFBFL7AN",
      "Component": "ENGINE",
      "Summary": "EXCESSIVE OIL CONSUMPTION. CAR WAS PURCHASED AT TEXAS DIRECT IN STAFFORD, TEXAS.  CAR CONSUMES APPROXIMATELY 1 QUART OF OIL EVERY 600-800 MILES. AT THIS RATE I AM CONSUMING 15-20 QUARTS BETWEEN REGULAR MANUFACTURERS OIL CHANGE RECOMMENDATIONS. ANY HELP WOULD BE GREATLY APPRECIATED.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11139101,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1530504000000-0400)/",
      "DateComplaintFiled": "/Date(1539039045000-0400)/",
      "VIN": "WAUAFAL0AN5",
      "Component": "POWER TRAIN",
      "Summary": "CAR RANDOMLY SHUT OFF AFTER MAKING A QUICK TURN CAUSING IT TO LOSE POWER AND STOPPED IN THE MIDDLE OF A BUSY INTERSECTION. LUCKILY I WAS ABLE TO MAKE IT TO THE SIDE OF THE ROAD BEFORE THE CAR COMPLETELY TURNED OFF. WAITED FOR A FEW MOMENTS TO TRY AND START TO CAR, AFTER THE 3 TIME TRYING, THE CAR STARTE.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11150979,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1541826000000-0500)/",
      "DateComplaintFiled": "/Date(1542049052000-0500)/",
      "VIN": "WAUAFAFL6AN",
      "Component": "ENGINE",
      "Summary": "I BOUGHT THE CAR 2 DAYS AGO AND ON THE WAY BACK FROM THE DEALERSHIP I'D ALREADY HAD TO ADD A QUART OF OIL, 2 DAYS LATER AFTER REFILLING AND I'M BASICALLY BACK TO ZERO ON OIL. I DON'T DRIVE MUCH SO THIS IS RIDICULOUS. THE OIL CONSUMPTION IS MUCH HIGHER THAN IT SHOULD BE, I'VE DRIVEN MAYBE 400 MILES AND I'VE HAD TO ADD OIL TWICE. I'VE NEVER HAD TO DO THIS WITH ANY OTHER CAR BEFORE, THIS IS MAD.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11065331,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1516597200000-0500)/",
      "DateComplaintFiled": "/Date(1517005868000-0500)/",
      "VIN": "WAUFFAL9AN0",
      "Component": "ENGINE",
      "Summary": "TAKATA RECALL MONDAY MORNING I WENT OUT TO START MY CAR TO BRING MY SON TO SCHOOL AND IT WOULD NOT START. WE DROVE IT THE DAY BEFORE AND NOTHING WAS WRONG WITH IT. WE HAD IT TAKEN BY FLAT BED TO AN AUTO SHOP. THEY SAID THE VALVES ARE BENT ON ONE SIDE OF THE BANKS. THEY SUGGESTED WE REPLACE THE ENGINE BECAUSE IF THEY PULL OFF THE HEAD AND THERE IS PISTON DAMAGE THEN WE WILL HAVE TO REPLACE THE ENGINE ANYWAYS AND GET CHARGED FOR THE DISASSEMBLY WHICH WOULD BE AN EXTRA $1200 ON TOP OF THE CHARGE FOR THE NEW ENGINE. WE BOUGHT THE CAR LESS THAN 2 YEARS AGO AND NEED TO PUT IN ALMOST $10,000 TO FIX IT.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11074036,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1517979600000-0500)/",
      "DateComplaintFiled": "/Date(1519229617000-0500)/",
      "VIN": "WAUSFAFL68A",
      "Component": "ENGINE",
      "Summary": "TIMING CHAIN TENSIONER FAILED CAUSING CATASTROPHIC ENGINE FAILURE AND STALL ON CITY  ROAD INTERSECTION FULL OF TRAFFIC.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11075185,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1519621200000-0500)/",
      "DateComplaintFiled": "/Date(1519744256000-0500)/",
      "VIN": "WAUBFAFL2AN",
      "Component": "ENGINE",
      "Summary": "HIGH OIL CONSUMPTION FOR YEARS, FROM FAULTY PISTONS AND PISTON RINGS LEADING TO CATASTROPHIC ENGINE FAILURE. REPEATED CONVERSATIONS WITH MY MECHANIC AND REVIEW OF AUDI BLOGS SHOWS THAT AUDI USA KNOWS ABOUT THIS PROBLEM AND HAS DONE NOTHING TO REPAIR IT.  WE WERE TOLD THE HIGH OIL CONSUMPTION WAS WITHIN PARAMETERS, BUT NOW THE CAR IS NO FIXABLE FOR A REASONABLE RATE.\r\n",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11074584,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1513400400000-0500)/",
      "DateComplaintFiled": "/Date(1519436017000-0500)/",
      "VIN": "WAUFFAFL5AN",
      "Component": "ENGINE",
      "Summary": "TIMING CHAIN TENSIONER FAILURE. CAUSING SIGNIFICANT ENGINE DAMAGE.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11121333,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1534824000000-0400)/",
      "DateComplaintFiled": "/Date(1534883380000-0400)/",
      "VIN": "WAUAFAFL7AN",
      "Component": "POWER TRAIN",
      "Summary": "DRIVING IN TRAFFIC AND CAR LOST POWER.  TRIED TO RESTART BUT NOT SUCCESSFUL.  DASHBOARD FLASHED MESSAGE \"GEARBOX MALFUNCTION:  YOU MAY CONTINUE TO DRIVE\".  THE CAR WOULD NOT START.  AFTER SITTING FOR TWO HOURS, THE CAR STARTED AND I WAS ABLE TO DRIVE HOME.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11129758,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1536811200000-0400)/",
      "DateComplaintFiled": "/Date(1537125153000-0400)/",
      "VIN": "WAUBFAFL4AN",
      "Component": "ENGINE",
      "Summary": "FULLY STOCK ENGINE AND DRIVE TRAIN CAR EXPERIENCED A TIMING CHAIN TENSIONER FAILURE. BEING AN INTERFERENCE ENGINE, THIS CAUSE CATASTROPHIC DAMAGE AND THE CAR REQUIRES A NEW ENGINE. I WAS FORTUNATE THIS HAPPENED WHILE STATIONARY AT A GAS STATION. I HAD DRIVEN ABOUT 100 MILES AND STOPPED FOR GAS. ATTEMPTING TO START THE CAR YIELDED CRANKING BUT NO TURNING OVER. THE CAR WAS TOWED TO A MECHANIC WHO CONFIRMED THE FAILURE VIA ENGINE COMPRESSION. THE FAILURE COULD HAVE HAPPENED WHILE ON MY HIGHWAY DRIVE AT HIGHWAY SPEEDS PUTTING MYSELF AND THE DRIVERS AROUND ME IN DANGER. THIS IS A KNOWN ISSUE AND A CLASS ACTION SETTLEMENT IS TAKING PLACE.  THE MANUFACTURER SHOULD BE FORCED TO RECALL ALL AFFECTED VEHICLES FOR TENSIONER REPLACEMENT.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11165752,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1543640400000-0500)/",
      "DateComplaintFiled": "/Date(1546583136000-0500)/",
      "Component": "ELECTRICAL SYSTEM | EXTERIOR LIGHTING",
      "Summary": "PASSENGER HEADLIGHT STAYS ON FOR 30 SECONDS WHILE DRIVING. I TURN THE KNOB OFF THEN BACK ON. IT STAYS ON FOR 30 SECONDS AGAIN AND GOES BACK OUT. I JUST HAD THE HEADLIGHTS REPLACED BECAUSE I THOUGHT THEY WERE GOING BAD. I PASSED ANOTHER CAR WITH THE SAME PASSENGER HEADLIGHT OUT THEN I NOTICED THE LIGHT IS NOT BLOWN ITS AN INTERNAL PROBLEM. IVE CHECKED THE WIRING CONNECTOR TO HEADLIGHT AND ITS FINE. I DID MORE RESEARCH ONLINE AND FOUND OUT ALOT OF PEOPLE EXPERIENCING THE SAME ISSUE. PLEASE LOOK INTO THIS ISSUE. I WORK AT NIGHT AND I NEED MY HEADLIGHT. IT DOES THE SAME WHILE PARKED",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11253758,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1563854400000-0400)/",
      "DateComplaintFiled": "/Date(1567820606000-0400)/",
      "VIN": "WAUAFAFL2AN",
      "Component": "ENGINE",
      "Summary": "CAR WAISTES TOO MUCH OIL, I HAVE TO CONTINUALLY CHANGE AND ADD NEW OIL APPROXIMATELY EVERY 15 DAYS OR LESS. I BOUGHT THE CAR APPROXIMATELY 3 MONTHS AGO FROM A FRIEND AND UP UNTIL 2 MONTHS AGO THE CAR SHOWED NO ISSUES. UP UNTIL ENDS OF JULY WHEN MY WIFE WAS DRIVING THE CAR BACK HOME FROM WORK AND THE CAR ALMOST OVERHEATED... I HAD CHANGED THE OIL 6 DAYS BEFORE. I TOOK THE CAR TO TWO DIFFERENT MECHANICS AND BOTH HAD THE SAME DIAGNOSTIC, BOTH STATED IT WAS A FACTORY ISSUE.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11240816,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1564200000000-0400)/",
      "DateComplaintFiled": "/Date(1564586407000-0400)/",
      "VIN": "WAUEFAFL3AN",
      "Component": "AIR BAGS",
      "Summary": "\"TAKATA RECALL\"  THE PASSENGER SIDE AIRBAG KEEPS BEEPING AND THINKING WE HAVE A PASSENGER IN THE CAR WHILE DRIVING. I HAVE TO BUCKLE THE EMPTY SEAT BELT TO MAKE THE AIRBAG WARNING BEEPS AND LIGHT STOP.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11242384,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1532664000000-0400)/",
      "DateComplaintFiled": "/Date(1565219800000-0400)/",
      "VIN": "WAUAFAFL8AN",
      "Component": "ENGINE | POWER TRAIN",
      "Summary": "CAR SUFFERED FROM CATASTROPHIC ENGINE FAILURE DUE TO KNOWN TIMING CHAIN ISSUES WITH THESE VEHICLES. THERE IS CURRENTLY A CLASS ACTION LAWSUIT REGARDING THIS ISSUE. HTTPS://TIMINGCHAINLITIGATION.COM/",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11267616,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1567656000000-0400)/",
      "DateComplaintFiled": "/Date(1570720079000-0400)/",
      "VIN": "WAUFFAFL0AN",
      "Component": "ENGINE",
      "Summary": "I WAS DRIVING TO WORK AND AS I SLOW DOWN TO PARK I HEARD AND FELT A POP IN THE ENGINE.  LUCKILY I WAS ABLE TO USE THE MOMENTUM OF THE CAR TO PARK.  THE ENGINE WOULD NOT TURN BACK ON.  AFTER WORK I WENT BACK AND THE CAR WOULD NOT TURN ON.  THE ENGINE WOULD JUST CLANK REALLY LOUD.  I HAD IT TOWED HOME AND THE NEXT DAY I CALLED THE MECHANIC.  I THEN TOWED THE CAR ABOUT A WEEK LATER TO THE MECHANIC FOR HIM TO CHECK IT OUT.  AFTER A FEW DAYS HE SAID THAT THE ENGINE CHAIN TENSIONERS BROKE AND CAUSED CATASTROPHIC DAMAGE TO THE ENGINE.  THE REPAIRS WOULD COST $4800 AND OR WE CAN PUT A NEW ENGINE FOR $6300.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11279103,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1571112000000-0400)/",
      "DateComplaintFiled": "/Date(1573283386000-0500)/",
      "VIN": "WAUFFAFL3AN",
      "Component": "ENGINE",
      "Summary": "AUDI KNOWS ABOUT THIS OIL CONSUMPTION ISSUE MY CAR IS ONE OF THE THOUSANDS OF AFFECTED ONE ITS REQUIRE MORE OIL JUST AFTER 300 MILES AND AUDI WONT FIX IT ASKING FOR 6K TO 7K TO FIX THE ENGINE I BARELY HAVE 110K MILES ON THE CAR. AUDI NEED TO RECALL THEIR AND FIX IT FOR FREE",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11298431,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1486443600000-0500)/",
      "DateComplaintFiled": "/Date(1578688584000-0500)/",
      "VIN": "WAUEFAFL4AN",
      "Component": "ENGINE",
      "Summary": "MY CAR USES A LOT OF OIL AND BLOWS CLOUDS OF OIL GOING UP HILLS. AUDI WANTS TO PUT A NEW ENGINE IN FOR $7K BECAUSE MY CAR IS OUT OF WARRANTY AND REFUSES TO DO IT FOR FREE. I DONT UNDERSTAND HOW AUDI COULD DO THIS AND GET AWAY WITH IT. NEVER BUYING AN AUDI AGAIN.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11322887,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1587441600000-0400)/",
      "DateComplaintFiled": "/Date(1588284270000-0400)/",
      "VIN": "WAUFFAFL6AN",
      "Component": "SUSPENSION",
      "Summary": "THE COIL SPRINGS BROKE ON THIS VEHICLE ON 2 SEPARATE OCCASIONS.  THE LEFT FRONT COIL SPRING BROKE WHILE IT WAS BEING DRIVEN BY MY HUSBAND ON 7/24/19.  THE LEFT REAR COIL SPRING BROKE WHILE I WAS TURNING OUT OF MY DRIVEWAY ON 4/21/20.  THE VEHICLE HAS OVER 81,000 MILES, BUT IS IN VERY GOOD CONDITION. I AM CAREFUL TO AVOID POT HOLES WHILE DRIVING, SO I DON'T BELIEVE THE CAUSE IS DUE TO MY DRIVING HABITS.  THE PHOTO I HAVE PROVIDED SHOWS THE BREAK IS NOT DUE TO RUST.  THIS HAS NEVER HAPPENED WITH ANY VEHICLE THAT I HAVE DRIVEN IN THE 50+ YEARS I HAVE BEEN DRIVING . MY UNDERSTANDING IS THAT A BROKEN COIL SPRING IS VERY DANGEROUS AND CAN CAUSE AN ACCIDENT PARTICULARLY IF IT PUNCTURES A TIRE WHILE DRIVING.  MY SUSPICION IS THAT THE COIL SPRINGS ARE DEFECTIVE GIVEN THAT THE BREAKS OCCURRED WITH 2 DIFFERENT COIL SPRINGS.  SINCE THIS HAS HAPPENED TWICE, I CHOSE TO REPLACE ALL THE COIL SPRINGS IN THE CAR BECAUSE I FEAR FOR MY SAFETY.  I UNDERSTAND THAT VOLKSWAGON, OF WHICH AUDI IS A PART OF, RECALLED OVER 56,000 VEHICLES LAST YEAR DUE TO DEFECTIVE COIL SPRINGS. HOWEVER, I CANNOT FIND ANY INFORMATION REGARDING A RECALL FOR AUDI COIL SPRINGS.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11352474,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1592020800000-0400)/",
      "DateComplaintFiled": "/Date(1598976756000-0400)/",
      "VIN": "WAUBFAFLXAN",
      "Component": "ENGINE",
      "Summary": "I DONT WHY AUDI HASNT RECALL THE 2010 AUDI A4 MY CAR WILL NOT HOLD OIL HAD THREE REAR MAIN SEALS PUT IN. EACH TIME THEY REPLACED SEAL IT WAS $1200. JUST HAD OIL CHANGE AND A WEEK LATER NEEDED TO PUT FOUR QUARTS OF OIL IN CAR. AUDI KNOWS ABOUT THIS PROBLEM BUT WONT RECALL THIS CAR. I HAD A FRIEND TAKE HIS CAR TO AUDI AND THEY REPLACED THE ENGINE FOR FREE.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11376957,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1604203200000-0400)/",
      "DateComplaintFiled": "/Date(1606675466000-0500)/",
      "VIN": "WAUBFAFL0AN",
      "Component": "ENGINE",
      "Summary": "I BOUGHT THIS VEHICLE WITH A GOOD PRICE. THE CAR ITSELF RUNS PRETTY GOOD BUT HAVE FOUND OUT THAT IT BURNS OIL AND IT IS FACTORY PROBLEM. I HAVE DONE SOME RESEARCH AND IT AUDI HAS THIS KIND OF PROBLEM. HIGH OIL CONSUMPTION \r\nIT CONSUMES 1 QT EVERY 200 MILES.\r\n",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10928132,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1479186000000-0500)/",
      "DateComplaintFiled": "/Date(1480222800000-0500)/",
      "VIN": "WAUFFAFL7AN",
      "Component": "ENGINE",
      "Summary": "I WAS LUCKY THAT MY CAR DID NOT FAIL WHILE DRIVING DOWN THE HIGHWAY LIKE OTHER OWNERS WITH THIS PROBLEM HAVE. THE TIMING TENSIONER AND CHAIN FAILED, CAUSING A COSTLY REPAIR. I UNDERSTAND THAT THERE ARE THREE CLASS-ACTION SUITS AGAINST AUDI-VW REGARDING THIS PROBLEM, YET NO RECALL. WHY? I WANT AUDI TO PAY FOR THIS COSTLY REPAIR AND HAVE A RECALL. I CAN SEND PHOTOS IF NECESSARY.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10940287,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1447477200000-0500)/",
      "DateComplaintFiled": "/Date(1483807802000-0500)/",
      "VIN": "WAUAFAFL3AN",
      "Component": "ENGINE",
      "Summary": "HIGH OIL CONSUMPTION FROM FAULTY PISTONS AND PISTON RINGS LEADING TO CATASTROPHIC ENGINE FAILURE.  BROKE EXHAUST VALVE AT HIGHWAY SPEED WHILE ON INTERSTATE. AUDI AWARE OF DEFECTS BUT DENIES RESPONSIBILITY.  THEY REFUSED MULTIPLE REASONABLE REQUESTS FOR HELP IN REPAIRS.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10898996,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1470801600000-0400)/",
      "DateComplaintFiled": "/Date(1472250258000-0400)/",
      "VIN": "WAUAFAFL2AN",
      "Component": "STEERING",
      "Summary": "A BENT STEERING SHAFT WAS NOT KNOWN UNDER NORMAL OPERATING CONDITIONS.  THIS BENT SHAFT PUT EXCESSIVE STRAIN ON THE POWER STEERING PUMP, WHICH CAUSES FAILURE AT SPEED WITHOUT ANY SIGNS OF IT FAILING.  THIS PREVENTED THE VEHICLE FROM BEING ABLE TO EASILY BE TURNED WHILE IN PROCESS OF TURNING THE WHEEL ALLOWING THE VEHICLE TO CONTINUE IN A STRAIGHT LINE TOWARDS ONCOMING TRAFFIC OR OTHER STATIONARY OBJECTS.  THIS OCCURRED AT VARIOUS SPEEDS AND SOMETIMES UNDER BRAKING.  THESE ISSUES WOULD BE INTERMITTENT AND NOT ABLE TO BE PREDICTED TO PREPARE AND TAKE ADDITIONAL MEASURES.  THIS IS KNOWN BY AUDI UNDER TECHNICAL SERVICE BULLETIN 2036032/2.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 11003991,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1499659200000-0400)/",
      "DateComplaintFiled": "/Date(1499700452000-0400)/",
      "VIN": "WAUFFAFL2AN",
      "Component": "ENGINE | FUEL/PROPULSION SYSTEM",
      "Summary": "EXCESSIVE OIL CONSUMPTION\r\nENGINE PROBLEM\r\n",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10960224,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1487134800000-0500)/",
      "DateComplaintFiled": "/Date(1489294800000-0500)/",
      "VIN": "WAUWFAFL5AA",
      "Component": "ENGINE",
      "Summary": "ENGINE MISFIRE LIKELY DUE TO TIMING CHAIN JUMP. EXTENSIVE REPAIR TO ENGINE INCLUDING INTAKE VALVES, TIMING CHAIN, TENSIONER, AND SEVERAL RELATED PARTS. \r\n\r\nAT THE TIME OF THE MALFUNCTION, THE VEHICLE WAS BEING DRIVEN IN ALBANY, NY, DURING HEAVY TRAFFIC. THE MALFUNCTION COULD HAVE RESULTED IN PERSONAL INJURY TO OCCUPANTS IN THIS VEHICLE AS WELL AS TO OTHER VEHICLES.\r\n\r\nCOST OF THE REPAIR WAS $3,194.46, AND RESULTED IN LOSS OF THE VEHICLE FOR 9 DAYS.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10910162,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1474776000000-0400)/",
      "DateComplaintFiled": "/Date(1475035200000-0400)/",
      "Component": "EXTERIOR LIGHTING",
      "Summary": "TAIL LIGHT (DRIVER'S SIDE) HAS A WATER LEAK PROBLEM.  MANY REPORTS OF THIS  ON VARIOUS AUDI FORUMS.  MAY CAUSE FAILURE OF TAIL, BRAKE, REVERSE LIGHTS OVER TIME.  VEHICLE HAS LESS THAN 50,000 MILES.  WE ARE THE ORIGINAL OWNERS.  NO APPARENT DAMAGE TO LIGHT HOUSING.",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    },
    {
      "ODINumber": 10917785,
      "Manufacturer": "Volkswagen Group of America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1474084800000-0400)/",
      "DateComplaintFiled": "/Date(1477063481000-0400)/",
      "VIN": "WAUAFAFL2AN",
      "Component": "ENGINE",
      "Summary": "OIL CONSUMPTION ISSUE RESULTING IN CONSTANTLY TOPPING-OFF OIL, PURCHASING OIL BY THE CASES. AUDI OF AMERICA CLEARLY STATES THAT THE AUDI DEALERSHIP IS REQUIRED TO FULFILL THE REPAIR OBLIGATION, SINCE MY VEHICLE IS WITHIN THE 80K MILEAGE/8 YEAR TIME FRAME, AUDI IS LIABLE TO MAKE THE RELATIVE REPAIRS. HOWEVER, THE AUDI OF TYSONS DEALERSHIP SEEMS TO BELIEVE OTHERWISE AND REFUSES TO ASSUME THE RESPONSIBILITY OF REPAIRS. THE DEALERSHIP COMPLETED PART ONE OF THE TESTING AND REQUESTED THAT I RETURN ONCE THE OIL LIGHT ILLUMINATED. AFTER RETURNING TO THE DEALERSHIP, THE RESISTANCE BEGAN. AFTER PROVIDING CONSISTENT SERVICE RECORDS OF OIL CHANGES THAT EXCLUDE THE \"ODOMETER READINGS\",  THE AUDI DEALERSHIP DID NOT GO TO THE NEXT PHASE OF TESTING/REPAIR. AS A RESULT, THE VEHICLE HAS STALLED ON THE BELTWAY(RISKY). ASSUMING RESPONSIBILITY OF A REPAIR NOW WOULD DEFINITELY ALLEVIATE A COSTLY PRICE TO PAY SHOULD AN ACCIDENT OCCUR RELATED TO THIS PROBLEM. SOMEONE NEEDS TO TAKE IMMEDIATE RECALL ACTION NOW OR PAY A MAJOR PRICE LATER! NOT THE WAY TO VALUE A CONSUMER AND A POOR WAY OF HANDLING THE MATTER!!!",
      "ProductType": "VEHICLE",
      "ModelYear": "2010",
      "Make": "AUDI",
      "Model": "A4"
    }
  ]
}