{
  "Count": 30,
  "Message": "Results returned successfully",
  "Results": [
    {
      "ODINumber": 11048600,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1511499600000-0500)/",
      "DateComplaintFiled": "/Date(1511758800000-0500)/",
      "VIN": "WP1AA29P14L",
      "Component": "AIR BAGS",
      "Summary": "TL* THE CONTACT OWNS A 2004 PORSCHE CAYENNE. WHILE THE CONTACT'S BROTHER WAS DRIVING APPROXIMATELY 65 MPH, THE FRONT DRIVER'S SIDE AIR BAG INADVERTENTLY DEPLOYED WITHOUT WARNING OR IMPACT. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THERE WERE NO INJURIES. THE MANUFACTURER WAS NOTIFIED AND A CASE WAS OPENED. THE CONTACT WAS ADVISED TO CALL A DEALER FOR A LOANER VEHICLE. THE CONTACT CALLED PORSCHE OF SILVER SPRING AT (888) 462-9925 (3141 AUTOMOBILE BLVD, SILVER SPRING, MD 20904) WHERE IT WAS CONFIRMED THAT NO LOANER VEHICLES WERE AVAILABLE. THE CONTACT THEN CALLED PORSCHE OF ROCKVILLE AT (855) 683-3144 (1125 ROCKVILLE PIKE, ROCKVILLE, MD 20852) AND PORSCHE OF ANNAPOLIS AT (443) 221-6940 (20 HUDSON ST, ANNAPOLIS, MD 21401) WHERE HE WAS ALSO INFORMED THAT NO LOANER VEHICLES WERE AVAILABLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 166,000. ",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10067244,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1081310400000-0400)/",
      "DateComplaintFiled": "/Date(1082001600000-0400)/",
      "Component": "EXTERIOR LIGHTING:HAZARD FLASHING WARNING LIGHTS:UNIT",
      "Summary": "WATER ACCUMULATED INSIDE THE HAZARD WARNING LIGHT LENS COMPARTMENT. DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM. *AK",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10083729,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(-2177434800000-0500)/",
      "DateComplaintFiled": "/Date(1090555200000-0400)/",
      "VIN": "WP1AB29P24L",
      "Component": "SUSPENSION:FRONT",
      "Summary": "PROBLEMS WITH TIRE EQUIPMENT ON 2004 CAYENNE.*MR\r\nTHE VEHICLE'S FRONT TIRES WERE WORN AT A LITTLE OVER 10000 MILES.  THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS LATER DETERMINED THAT THERE WAS A RECALL ON THE FRONT END ALIGNMENT THAT POSSIBLY CAUSED THE TIRES TO WEAR PREMATURELY.  THE MANUFACTURER AGREED TO SPLIT THE DIFFERENCE OF THE PRO-RATED COST.  THE CONSUMER REQUEST REIMBURSEMENT FOR THE TIRES HE HAD TO REPLACE AND WOULD LIKE PORSCHE TO BUT OUT THE REMAINING TIME ON HIS LEASE.  *NM ",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10115621,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "Yes",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1106629200000-0500)/",
      "DateComplaintFiled": "/Date(1111122000000-0500)/",
      "VIN": "WP1AA29P24L",
      "Component": "SERVICE BRAKES, HYDRAULIC:ANTILOCK/TRACTION CONTROL/ELECTRONIC LIMITED SLIP | TIRES",
      "Summary": "THE CONSUMER'S 2004 PORSCHE CAYENNE WAS UNCONTROLLABLE WITH THE SLIGHTEST SNOWFALL.  *NM  WHEN THE CONSUMER APPROACHED AN INTERSECTION HE WAS UNABLE TO STOP AND CONSEQUENTLY HE HIT ANOTHER VEHICLE.   THE MANUFACTURER HAS ACKNOWLEDGED THERE IS A PROBLEM WITH THE TIRES.  THE CONSUMER ALSO STATED THE ABS WAS ERRATIC. *JB",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10144154,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1129348800000-0400)/",
      "DateComplaintFiled": "/Date(1133413200000-0500)/",
      "VIN": "WP1AA29P64L",
      "Component": "AIR BAGS",
      "Summary": "CIRCLE IMPORTS LONG BEACH, CA A PORSCHE DEALER INSTALLED A NEW STEERING WHEEL ON OUR 04 PORSCHE CAYENNE.  IN ONE WEEK TIME ON OCT. 15, 2005 THE AIR BAG IN THE CENTER OF THE WHEEL STARTED COMING LOOSE AND WAS FALLING OFF THE WHEEL.  THE REPAIR TO THIS PROBLEM OCCURRED IN JUST A FEW DAYS HOWEVER, WHEN I QUESTIONED WHY THERE WERE NO SENSORS GIVING ME A WARNING, I WAS TOLD THAT NO SENSORS EXIST.  WHEN I ASKED THE DEALER TO CONTACT PORSCHE CORPORATE TO PRESENT THIS PROBLEM, I WAS TOLD THERE WAS NOTHING THEY COULD DO.  SHORTLY AFTER THAT I EMAILED TO PORSCHE CORPORATE HOWEVER, NO ONE BOTHER TO REPLY.  DURING THAT TIME I CALLED THEIR PORSCHE SURVEY CENTER BECAUSE OF A POST CARD I RECEIVED REGARDING THE QUALITY OF SERVICE, AGAIN NO ONE REPLIED TO ME.  I HAVE COLOR PHOTOS OF THE DEFECTIVE AIR BAG/STEERING WHEEL AND SERVICE PAPERS SHOWING THAT SERVICE TOOK PLACE ON DATE MENTIONED ABOVE.  I WOULD BE GLAD TO SHARE THE PICTURES WITH YOU AND I HOPE SOMEONE CAN GET PORSCHE TO RETROFIT A SENSOR TO THIS PROBLEM.  I AM CERTAIN THAT IF WE HAD BEEN INVOLVED IN AN ACCIDENT THE AIR BAG WOULD NOT HAVE WORKED PROPERLY.  ONCE YOU SEE THE PICTURES I THINK YOU'LL AGREE WITH MY FINDINGS.  IF NEED TO I CAN ALSO PROVIDE 2 WITNESSES THAT DAY THAT SAW FIRST HAND THE DEFECTIVE AIRBAG.\r\n\r\nBEYOND THIS THE DEALER HAD PUT ON 40 MILES TO MY CAR DURING SERVICE WITHOUT AUTHORIZATION.  THIS PORTION I WILL TAKE UP WITH THE BETTER BUSINESS BUREAU UNLESS THIS FALLS IN YOUR JURISDICTION AS WELL AS THE ABOVE SAFETY ISSUE?\r\n\r\nBEST REGARDS,\r\n\r\nCHUCK YANG\r\nCELL 714-928-2788.  *NM",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10159265,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1133154000000-0500)/",
      "DateComplaintFiled": "/Date(1149652800000-0400)/",
      "VIN": "WP1AA29P95L",
      "Component": "ELECTRICAL SYSTEM",
      "Summary": "BREACH OF WARRANTY CLAIMS, INCLUDING BUT NOT LIMITED TO IGNITION FAILURE, WIRING HARNESS PROBLEMS, AIRBAG ILLUMINATION WARNINGS, LOCK FAILURE, WINDOW FAILURE, ALL WITHIN THE FIRST 10 MONTHS.  THE VEHICLE DOES NOT GO MORE THAN 2 OR 3 MONTHS AND 3,000 TO 4,000 MILES WITHOUT HAVING THESE PROBLEMS COME BACK DESPITE NUMEROUS ATTEMPTS TO REPAIR THE CAR.  TWICE THE CAR WOULD NOT SHUT OFF AND A THIRD TIME THE KEY BECAME LOCKED IN THE IGNITION AND THE IGNITION WOULD NOT TURN, START, ETC.  THE LOCKS ALSO FAILED AND COULD NOT PUT THE CAR IN GEAR TO TOW.  BECAME STUCK ON THE ROAD.  MANUFACTURER & DEALER CAN'T GUARANTEE THE RELIABILITY OF VEHICLE BUT REFUSES TO DO ANYTHING BUT CONTINUE TO TEMPORARILY REPAIR CAR.  THE CAR HAS BEEN IN SERVICE OVER 30 DAYS WITHIN 10 MONTH PERIOD (AND COUNTING). *JB",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10230582,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1211342400000-0400)/",
      "DateComplaintFiled": "/Date(1213156800000-0400)/",
      "VIN": "WP1AA29P94L",
      "Component": "POWER TRAIN:DRIVELINE",
      "Summary": "BEGINNING IN AUGUST 2007, MY CAR EXPERIENCED TRANSMISSION SHIFTING PROBLEMS AND EVENTUALLY HAD TO HAVE THE CONTROL UNIT REPLACED. AFTERWARDS THE TRANSMISSION SHIFTED DIFFERENTLY, BUT I ASSUMED THAT WAS RELATED TO THE NEW CONTROL UNIT. IN EARLY 2008, THE TRANSMISSION SEEMED TO RUN ROUGHER DURING WARM UP AND OCCASIONALLY THE RIGHT TIRE WOULD ?SKIP? AS IF TRACTION CONTROL ENGAGED FOR A BRIEF PERIOD. I ASSUMED (INCORRECTLY) THAT THIS WAS DUE TO TIRE WEAR. \r\nFINALLY, IN MAY 2008, THE DRIVE SHAFT FAILED. THIS WAS TWO MONTHS AFTER THE WARRANTY PERIOD AND AT 52,764 MILES. I HAVE READ ONLINE THAT THIS DRIVESHAFT HAS HAD MANY FAILURES, AND THAT DEALERSHIPS KEEP SEVERAL ON HAND TO ADDRESS THE RELATED PROBLEMS. WITH THAT IN MIND, I  REQUESTED THAT PORSCHE REPLACE THE DRIVESHAFT UNDER WARRANTY.  THE PART COST $895.51 PLUS $69.40 IN TAX FOR A TOTAL OF $964.91. SINCE THE LABOR WAS PERFORMED AT MY LOCAL SERVICE CENTER, I AM REQUESTING ONLY REIMBURSEMENT FOR THE PART.\r\nI HAVE SAVED THE FAILED PART AND CAN ALSO SUPPLY YOU WITH THE ORIGINAL PAPERWORK. I AM ATTACHING COPIES OF THE REPAIR BILL (IMPORT SPECIALTIES) AND THE PREVIOUS WARRANTY WORK (NEWPORT AUTO CENTER).\r\n\r\nPORSCHE DENIED THE CLAIM ON JUNE 9, 2008. THE DRIVESHAFT REPRESENTS BOTH A DEFECTIVE PART AND A POTENTIAL FOR A DANGEROUS SITUATION IT THE UNIT FAILED AT A HIGH SPEED.  *TR\r\n",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10369061,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1291266000000-0500)/",
      "DateComplaintFiled": "/Date(1291352400000-0500)/",
      "Component": "VEHICLE SPEED CONTROL",
      "Summary": "TL*THE CONTACT OWNS A 2004 PORSCHE CAYENNE. WHILE DRIVING APPROXIMATELY 60 MPH, THE CONTACT HEARD A TICKING NOISE FOLLOWED BY A LOUD, THUMPING NOISE WHICH CAUSED THE VEHICLE TO ACCELERATE. THE LOCAL AUTHORIZED DEALER STATED THAT THE BEARING AND DRIVE TRAIN NEEDED TO BE REPLACED. THE MANUFACTURER HAD NOT BEEN NOTIFIED. THE VEHICLE WAS BEING REPAIRED BY THE DEALER. THE VIN WAS UNAVAILABLE. THE CURRENT MILEAGE WAS APPROXIMATELY 93,000. THE FAILURE MILEAGE WAS APPROXIMATELY 90,000.",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10453679,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1333166400000-0400)/",
      "DateComplaintFiled": "/Date(1333166400000-0400)/",
      "Component": "ENGINE AND ENGINE COOLING",
      "Summary": "CRACK IN ORIGINAL PLASTIC COOLANT PIPES.    *JS",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10465393,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1287374400000-0400)/",
      "DateComplaintFiled": "/Date(1342065600000-0400)/",
      "VIN": "WP1AB29P54L",
      "Component": "ENGINE",
      "Summary": "WHILE DRIVING CHECK ENGINE LIGHT ON AND VEHICLE LACK POWER. DROVE TO INDEPENDENT REPAIR SERVICE, REPLACED 8 IGNITION COILS AND 8 SPARK PLUGS TO CORRECT PROBLEM. ALL IGNITION COILS CRACKED.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10465394,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1285732800000-0400)/",
      "DateComplaintFiled": "/Date(1342065600000-0400)/",
      "VIN": "WP1AB29P54L",
      "Component": "STRUCTURE:BODY",
      "Summary": "REAR LIFT GATE WOULD NOT STAY OPEN. DROVE TO INDEPENDENT REPAIR SERVICE, REPLACED BOTH REAR LIFTGATE SHOCK SUPPORTS. PORSCHE WOULD NOT COVER REPAIRS.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10465403,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1306900800000-0400)/",
      "DateComplaintFiled": "/Date(1342065600000-0400)/",
      "VIN": "WP1AB29P54L",
      "Component": "ENGINE",
      "Summary": "DRIVING ON INTERSTATE HIGHWAY, CHECK ENGINE AND ADD COOLANT LIGHTS ON. STOPPED ADDED COOLANT, DROVE HOME PARKED IN DRIVEWAY. OUT TO USE CAYENNE AGAIN, NOTICED COOLANT ON DRIVEWAY, STARTED ENGINE COOLANT LEAK ALLOVER DRIVE. CALLED PORSCHE DEALER, NOT COVERED UNDER WARRENTY, ALSO 2 WEEK BACKLOG IN GETTING REPAIR, CALL INDEPENDENT SERVICE AND HAD TOW TO INDEPENDENT GARAGE. REPLACE ALL COOLANT PIPES AND WATER PUMP.  AFTER REPAIR \"INTERNAL ENGINE NOISE\". OK TO DRIVE. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10465406,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1317268800000-0400)/",
      "DateComplaintFiled": "/Date(1342065600000-0400)/",
      "VIN": "WP1AB29P54L",
      "Component": "ENGINE",
      "Summary": "DRIVING VEHICLE, HEARD NOISE AND ENGINE LIGHTS ON. STOP CHECK ENGINE, BELTS OFF. TOW TO SERVICE FACILITY. WATER PUMP PULLEY WAS FOUND TO SPLIT, MADE OF FIBER. REPLACED PULLEY AND MULTI RIB BELT. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10465407,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1336363200000-0400)/",
      "DateComplaintFiled": "/Date(1342065600000-0400)/",
      "VIN": "WP1AB29P54L",
      "Component": "ENGINE",
      "Summary": "AT 38,785 MILES COOLANT PIPES LEAKING AND REPLACED. AFTER REPAIR \"INTERNAL ENGINE NOISE\" AND NOISE IS NOW LOUDER AND ENGINE USE MORE OIL. TOOK TO LOCAL PORSCHE DEALER VEHICLE STILL AT PORSCHE DEALER BECAUSE DEALER STATES\" ENGINE NEEDS REPLACED\" BECAUSE IF OVERHEATED DUE TO COOLANT PIPE FAILURE PISTONS WALLS DAMAGED. DEALER CHECKING WITH PORSCHE TO FIND OUT IF THEY WILL PAY SOMETHING OR ALL OF COST TO REPLACE ENGINE. CAYENNE AT PORSCHE DEALER FOR OVER 60 DAYS WITH NO OUTCOME AS TO WHAT PORSCHE WILL PAY. COULD COST UP TO $20,000 IF INVOICED TO ME. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10630106,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1392354000000-0500)/",
      "DateComplaintFiled": "/Date(1409683698000-0400)/",
      "VIN": "WP1AB29P64L",
      "Component": "ENGINE | POWER TRAIN",
      "Summary": "UPON TAKING THE VEHICLE OUT OF THE DRIVEWAY I STARTED HEARING A TICKING SOUND COMING FROM THE ENGINE, SOMETHING LIKE A LIFTER HITTING THE BLOCK. I PULLED BACK IN TO MY DRIVEWAY AND CALLED A REPAIR SHOP AND SCHEDULED AN APPOINTMENT. WHEN MEETING WITH THE TECHNICIAN I WAS INFORMED THAT THE ENGINE HAD A SCORED CYLINDER AND THAT IT IS A COMMON ISSUE WITH THE MODEL AND YEAR. THE ONLY RECOURSE TO FIX THE ISSUE WOULD BE TO REPLACE THE ENGINE. A REPLACEMENT ENGINE WOULD COST $17 -35,000 - MORE THAN THE VEHICLE IS WORTH. IF I WERE TO REPLACE IT WITH A  USED ENGINE, I WOULD BE DESTINED FOR A REPEAT OF THE SAME ISSUE. IF THIS ISSUE IS SUCH A COMMON PROBLEM WHY HAS THERE NOT BEEN A RECALL FOR THESE VEHICLES? \r\nI HAVE CONTACTED THE MANUFACTURER AND WAS TOLD THAT I WOULD NEED TO HAVE A AUTHORIZED SERVICE DEALERSHIP MAKE THE DIAGNOSIS I HAVE ALREADY BEEN TOLD, BUT THERE IS NOT A AUTHORIZED DEALERSHIP WITHIN 500 MILES OF MY LOCATION.  ",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10644678,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1413172800000-0400)/",
      "DateComplaintFiled": "/Date(1413259200000-0400)/",
      "Component": "ENGINE",
      "Summary": "ENGINE COOLANT HOSES ARE LEAKING ANTIFREEZE. EVERYTIME I POUR ANTIFREEZE INTO THE CAR IT COMES OUT, IM AFRAID IT MIGHT DAMAGE SOMETHING ELSE, LIKE THE ENGINE ETC. THEY HAVE PLASTIC HOSES ON THEM.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10787569,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1072933200000-0500)/",
      "DateComplaintFiled": "/Date(1446440400000-0500)/",
      "VIN": "1AC29P74LA9",
      "Component": "ENGINE | UNKNOWN OR OTHER",
      "Summary": "PORSCHE LURCHES,JERKS,THUDS,INTERMITTENT POWER LOSS WHEN ACCELERATING TO PASS ANOTHER CAR.  ENGINE,TRANSMISSION/TURBO SYSTEM FAULTY AND HAZARDOUS AS POWER LOSS OCCURS WHEN QUICK SPEED-UP WHEN PASSING POWER IS CRITICALLY NEEDED. THIS POWER FAILURE PROBLEM HAS OCCURRED SINCE CAR WAS BOUGHT NEW IVY ME IN 2004.",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10807887,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1447131600000-0500)/",
      "DateComplaintFiled": "/Date(1448946000000-0500)/",
      "VIN": "WP1AA29P24L",
      "Component": "ELECTRICAL SYSTEM",
      "Summary": "THIS VEHICLE ALLOWS YOU TO BE LOCKED INSIDE. AFTER DRIVING IF THE DRIVER AND PASSENGER OPEN THEIR DOORS THEN THE LOCK BUTTON IS HIT ON THE KEY (WHILE THE DOORS ARE STILL OPEN), THEN THE DOORS ARE CLOSED ANYONE INSIDE IN UNABLE TO UNLOCK ANY DOORS, EVEN WHEN HITTING THE UNLOCK BUTTON INSIDE THE VEHICLE LOCATED ON THE DOOR. THIS IS A HUGE SAFETY CONCERN.",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10822439,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1418360400000-0500)/",
      "DateComplaintFiled": "/Date(1453861115000-0500)/",
      "VIN": "WP1AB29P74L",
      "Component": "ELECTRICAL SYSTEM | ENGINE",
      "Summary": "ITS SEEMS TO BE TRANSMISSION IS SLIPS INTO FOUR WHEELS DRIVE, SOMETIME IT STUCK IN A DRIVE GEAR.",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 11052953,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "Yes",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1463112000000-0400)/",
      "DateComplaintFiled": "/Date(1512622800000-0500)/",
      "Component": "FUEL/PROPULSION SYSTEM",
      "Summary": "TL* THE CONTACT OWNED A 2004 PORSCHE CAYENNE. WHILE PARKED AT HOME, THE VEHICLE CAUGHT FIRE. THE FIRE DEPARTMENT WAS CONTACTED AND THE FIRE WAS EXTINGUISHED. A POLICE REPORT WAS FILED. THE CONTACT'S HOUSE SUSTAINED FIRE DAMAGE. THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE VEHICLE WAS PREVIOUSLY TAKEN TO PORSCHE OF NORTH OLMSTED LOCATED 28400 LORAUIN RD, NORTH OLMSTEAD, OH WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE CONTACT LATER RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V576000 (FUEL SYSTEM, GASOLINE) AFTER THE FAILURE OCCURRED. THE VEHICLE WAS DEEMED DESTROYED. THERE WERE NO INJURIES. THE VIN WAS NOT PROVIDED. THE FAILURE MILEAGE WAS APPROXIMATELY 100,000. ",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 11082462,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1522641600000-0400)/",
      "DateComplaintFiled": "/Date(1522641600000-0400)/",
      "VIN": "WP1AB29P64L",
      "Component": "FUEL/PROPULSION SYSTEM",
      "Summary": "TL* THE CONTACT OWNS A 2004 PORSCHE CAYENNE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V576000 (FUEL SYSTEM). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR AS THE RECALL NOTICE WAS RECEIVED OVER FIVE MONTHS AGO. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER STATED THAT THE PARTS TO DO THE REPAIR WERE UNAVAILABLE AND WAS UNABLE TO CONFIRM WHEN THE PARTS WOULD BE AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. ",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 11084480,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1511931600000-0500)/",
      "DateComplaintFiled": "/Date(1523414815000-0400)/",
      "VIN": "WP1AB29P44L",
      "Component": "FUEL/PROPULSION SYSTEM",
      "Summary": "\"PORSCHE SAFETY RECALL AH10\" I RECEIVED A RECALL NOTIFICATION IN THE MAIL NOVEMBER '17 FOR THE REPLACEMENT OF THE FILTER FLANGE FUEL PUMP. DURING THE TIME, I DID NOT EXPERIENCE ANY CHANGES WITH MY VEHICLE, BUT I STILL CALLED TO HAVE MY VEHICLE REPAIRED. I WAS TOLD THAT THE PARTS ARE NOT IN AND I WOULD BE NOTIFIED WHEN THE PARTS WERE AVAILABLE. WITHIN THE LAST 3 WEEKS, I HAVE SMELLED GAS IN AND AROUND MY CAR. I AM CONVINCED THIS IS DUE TO MY VEHICLE NOT BEING REPAIRED FOR AN EXTENDED PERIOD OF TIME. I CONTACTED BOTH PORSCHE LOCATIONS IN MY AREA (NORTH OLMSTED AND BEACHWOOD, OHIO) TO SEE IF THERE WILL BE REIMBURSEMENT OF A RENTAL CAR OR IF A LOANER VEHICLE CAN BE PROVIDED UNTIL THE PARTS ARE IN AS I TRANSPORT A NEWBORN BABY IN MY VEHICLE ON A DAY TO DAY BASIS AND DO NOT WANT TO RUN THE RISK OF EITHER OF US BEING AFFECTED BY THIS FUEL LEAK. I'M AFRAID IF THE FUEL LEAKAGE ISN'T REPAIRED SOON IT MAY CAUSE A FIRE WHICH WILL BE A HAZARD TO MYSELF, CHILD, AND OTHER MOTOR VEHICLES ON THE ROAD. I AM REACHING OUT TO SEE OF THERE ARE ANY ALTERNATIVE TRANSPORTATION METHODS FOR THOSE INDIVIDUALS WHO WERE AFFECTED BY THIS ACTION. PLEASE ADVISE.",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 11084484,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1520312400000-0500)/",
      "DateComplaintFiled": "/Date(1523416640000-0400)/",
      "VIN": "WP1AB29P14L",
      "Component": "ENGINE | FUEL/PROPULSION SYSTEM | POWER TRAIN",
      "Summary": "1) COOLANT PIPE PROBLEMS,PORSCHE NEVER FIX THEM ,HAD PAY TO GET THEM FIX.(2) FILTER FLANGE FUEL PUMP LEAKAGE,PROBLEMS PORSCHE SAID UNFORTUNATELY, AT THIS TIME PARTS ARE NOT AVAILABLE.HAD IT REPAIR MY OWEN MONEY, DID NOT WANT TO CHANCE  A RISK OF FIRE.(3) TRANSMISSION MODULE PROBLEMS DID NOT SHIFT RIGHT,HAD TO BUY NEW ONE.TO MANY PROBLEMS.",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 11092779,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1512018000000-0500)/",
      "DateComplaintFiled": "/Date(1525908932000-0400)/",
      "VIN": "WP1AB29P74L",
      "Component": "FUEL/PROPULSION SYSTEM",
      "Summary": "RECALL #AH10. MY TRUCK LEAK GAS EVERYWHERE; AND I'VE CALLED GAUDIN PORSCHE THEY SAID THEY'RE NOT DOING ANY RECALLS AT THE MOMENT. I CAN'T AFFORD TO FIX IT NOR CAN AFFORD THE GAS LOST.",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 11141417,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1534651200000-0400)/",
      "DateComplaintFiled": "/Date(1539921600000-0400)/",
      "VIN": "WP1AC29P84L",
      "Component": "POWER TRAIN:DRIVELINE:DRIVESHAFT",
      "Summary": "TL* THE CONTACT OWNS A 2004 PORSCHE CAYENNE. WHILE DRIVING AND ACCELERATING, THE DRIVESHAFT MALFUNCTIONED, WHICH CAUSED THE VEHICLE TO WOBBLE AND SHAKE. THE CONTACT CALLED MOMENTUM PORSCHE (10155 SOUTHWEST FWY, HOUSTON, TX 77074, (844) 894-5470) AND WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL. THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 180,000. ",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 11165743,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1511758800000-0500)/",
      "DateComplaintFiled": "/Date(1546573783000-0500)/",
      "Component": "FUEL/PROPULSION SYSTEM",
      "Summary": "I RECEIVED A RECALL LETTER IN NOVEMBER OF 2017 NHTSA CAMPAIGN NUMBER: 17V576000.  \r\nFUEL PUMP FLANGE MAY CRACK CAUSING FUEL LEAK\r\nA FUEL LEAK IN THE PRESENCE OF AN IGNITION SOURCE INCREASES THE RISK OF A FIRE.\r\nMY LOCAL DEALER KEEPS TELLING ME NO PARTS AVAILABLE.  I FIND THE TIMELINE UNACCEPTABLE AND I WANT THE RECALL REMEDIED IMMEDIATELY.  WE ARE PUSHING TWO YEARS WITH NO REPAIR.",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 11253537,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1567569600000-0400)/",
      "DateComplaintFiled": "/Date(1567748155000-0400)/",
      "VIN": "WP1AB29PX4L",
      "Component": "POWER TRAIN",
      "Summary": "TRANSMISSION TRANSFER CASE ISSUES IMMEDIATELY AFTER ACCELERATION BETWEEN 3 GEARS... CAR TRANSMISSIONS \"STUMBLES\" (TRANSMISSION LOCKING).  WELL KNOWN ISSUE IN THE PORSCHE COMMUNITY AND PORSCHE SOLUTION IS DOES NOT FIX THE ISSUE.  NO ENGINE ERROR CODES ISSUED AS WELL.  PORSCHE SAYS CANNOT DUPLICATE PROBLEM.  THIS HAS BEEN HAPPENING FOR QUITE A WHILE UNTIL I RESEARCHED THE ISSUES ONLINE.  PREVIOUSE RECALL #  03V351000  - PORSCHE WILL NOT CURRENTLY HONOR THIS RECALL.",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 11280095,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "Yes",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1561521600000-0400)/",
      "DateComplaintFiled": "/Date(1574226000000-0500)/",
      "VIN": "WP1AB29P24L",
      "Component": "POWER TRAIN",
      "Summary": "2004 PORSCHE CAYENNE. CONSUMER WRITES IN REGARDS TO TRANSMISSION SHIFT LEVER SAFETY RECALL. *LD\r\n\r\nTHE CONSUMER STATED THE VEHICLE WAS PARKED AND ROLLED INTO  ANOTHER VEHICLE WHICH, THEN CRASHED INTO A VEHICLE. THE TRANSMISSION SHIFT LEVER FAILED AND WAS REPLACED. THE CONSUMER REQUESTED TO BE REIMBURSED FOR THE REPAIRS TO THE VEHICLES. *JS *JS",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 11319375,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "Yes",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1414814400000-0400)/",
      "DateComplaintFiled": "/Date(1585195200000-0400)/",
      "VIN": "WP1AC29P04L",
      "Component": "POWER TRAIN",
      "Summary": "TL* THE CONTACT OWNS A 2004 PORSCHE CAYENNE. THE CONTACT STATED HE PARKED THE VEHICLE IN HIS DRIVE WAY WITHOUT THE EMERGENCY BREAK ENGAGED AND LEFT TO ENTER HIS RESIDENCE. THE CONTACT STATED WITHIN 2-3 MINUTES LATER, WHEN EXITING HIS RESIDENCE, THE VEHICLE INADVERTENTLY SHIFTED GEARS TO REVERSE AND ROLLED AWAY FROM HIS RESIDENCE. THE CONTACT STATED THE VEHICLE HIT TWO TREES, A FENCE, CONTINUED TO ROLL AWAY AND HIT A SECOND FENCE WHICH DETAINED THE VEHICLE. AIR BAGS DID NOT DEPLOY. THE CONTACT STATE NO ONE WAS INJURED. THE CONTACT STATED HE HAD TO BREAK THE REAR PASSENGER SIDE WINDOW TO ENTER AND TURN OFF THE VEHICLE. THE VEHICLE WAS TAKEN TO A BODY SHOP FOR BODY DAMAGE REPAIRS. THE CONTACT STATE AT THAT MOMENT HE DID NOT CONTACT THE DEALER TO HAVE THE VEHICLE DIAGNOSED. THE CONTACT STATES HE RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 19V446000 (POWER TRAIN) IN SEPTEMBER OF 2019. THE VEHICLE WAS TAKEN PORSCHE OF OMAHA (6625 L ST, OMAHA, NE 68117) WHERE THE RECALL REPAIRS WERE SERVICED. THE MANUFACTURER HAD BEEN INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 90,000. ",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    },
    {
      "ODINumber": 10958627,
      "Manufacturer": "Porsche Cars North America, Inc.",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1422507600000-0500)/",
      "DateComplaintFiled": "/Date(1488668382000-0500)/",
      "VIN": "WP1AC29P24L",
      "Component": "ELECTRICAL SYSTEM | EXTERIOR LIGHTING | SUSPENSION",
      "Summary": "THERE ARE SO MANY PROBLEMS WITH THIS CAR.. COOLANT PIPES LEAK. OILS LEAKAGE. FAILURE OF LIGHTS ELICTRICAL ISSUES SUCH AS HORN, REMOTE ENTRY, SUSPENSION  AXLE WHEEL BARRINGS. FUEL INJECTORS. WHILE DRIVING THE VEHICLE THE CAR",
      "ProductType": "VEHICLE",
      "ModelYear": "2004",
      "Make": "PORSCHE",
      "Model": "CAYENNE"
    }
  ]
}