{
  "Count": 80,
  "Message": "Results returned successfully",
  "Results": [
    {
      "ODINumber": 10225131,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(-2177434800000-0500)/",
      "DateComplaintFiled": "/Date(1208491200000-0400)/",
      "VIN": "WBSWD93568P",
      "Component": "ELECTRICAL SYSTEM | UNKNOWN OR OTHER",
      "Summary": "BMW M3 EXPERIENCING SOS FAILURE. CONSUMER STATES THAT THE SOS FAILURE WARNING AND RADIO DID NOT WORK. SHE STATES THAT IT WAS UNINTELLIGIBLE WHEN SHE PRESSED THE SOS BUTTON. DEALER STATED THAT IT WOULD BE OK.  *KB\r\nTHE CONSUMER WAS TOLD THE PROBLEM WAS CAUSED BY HIS NON BMW CELL PHONE WHICH WAS NOT COMPATIBLE WITH THE TCU, WHICH CAUSED IT TO LOCKED UP AND SHUT DOWN DIFFERENT FUNCTIONS IN THE VEHICLE. *JB",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10228091,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1210824000000-0400)/",
      "DateComplaintFiled": "/Date(1210996800000-0400)/",
      "Component": "VISIBILITY:WINDSHIELD",
      "Summary": "MY WINDSHIELD EASILY GETS ROCK CHIPS AND DENTS.  IT APPEARS THAT ANY ROCKS/PEBBLES THAT HIT THE WINDSHIELD RESULT IN A DENT.  I ONLY HAVE 1,300 MILES ON THE VEHICLE AND ALREADY HAVE ABOUT 4 CHIPS IN THE WINDSHIELD   IT EASILY BECOMES TARNISHED.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10227254,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 1,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1209096000000-0400)/",
      "DateComplaintFiled": "/Date(1210478400000-0400)/",
      "Component": "STRUCTURE",
      "Summary": "CAR = BMW 328 CONVERTIBLE WITH COMFORT ACCESS OPTION\r\nYEAR = 2008 AND 2007 (HARD TOP CONVERTIBLE\r\nREQUIRED OPTION = COMFORT ACCESS FOR REMOTE ROOF OPEN/CLOSE\r\n1)  WHILE EVERYONE WAS STANDING OUTSIDE THE CAR WITH THE ROOF OPEN THE SALESMAN DEMONSTRATED THE REMOTE ACCESS OPTION CLOSING THE ROOF.\r\n2)  THE ROOF CLOSED.\r\n3)  I REACHED INTO THE REAR WINDOW TO TOUCH SOMETHING IN THE BACK SEAT AREA\r\n4) THE WINDOWS RAISED UP CATCHING MY ARM BETWEEN THE REAR WINDOW ON THE PASSENGER SIDE AND THE HARD-TOP ROOF.\r\n5)  MY ARM WAS CAUGHT FOR SEVERAL MINUTES AS THE SALESMAN TRIED TO COMMAND EITHER THE WINDOW TO LOWER OR THE ROOF OPERATION TO REVERSE.\r\n6)  THE REMOTE ACCESS ROOF CLOSURE PROGRAM RELENTLESSLY TRIED TO CLOSE THE WINDOW EVEN THOUGH MY ARM WAS NOW FULLY CAUGHT AND MY WIFE (IN TEARS) NOR THE SALESMAN OR ANY OTHER STAFF AT THE LARGE DEALERSHIP COULD HELP ME.\r\n7)  I FINALLY PULLED MY ELBOW PAST THE WINDOW SUFFERING MINOR SCRAPES AND SOME FAIRLY SIGNIFICANT NERVE DAMAGE.\r\n8)  I AM GLAD THAT IT WASN'T MY NECK OR THE APPENDAGE OF A CHILD.\r\n\r\nI NOTIFIED BMW AG AND BMW USA OF THIS EVENT.  IT IS LIKELY THEY WILL TAKE NO AUTONOMOUS ACTION TO FIX THE PROBLEM.  IN MY OPINION THE REAR WINDOWS NEED PINCH PROTECTION CIRCUITRY AND THE REMOTE ACCESS CLOSING PROGRAM NEEDS A TIME-OUT FUNCTION RATHER THAN THE RELENTLESS \"MUST CLOSE WINDOWS\" PROGRAM THAT IS CURRENTLY A THREAT TO ANYONE WHO HAPPENS TO GET CAUGHT DURING THIS OPERATION.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10229257,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1211428800000-0400)/",
      "DateComplaintFiled": "/Date(1212033600000-0400)/",
      "VIN": "WBAVD53508A",
      "Component": "FUEL SYSTEM, GASOLINE",
      "Summary": "CAR HAD LONGER AND LONGER CRANK TIMES AT STARTUP. OVER THE SPAN OF A WEEK THE STARTUP TIME BEFORE IGNITION TOOK UP TO 5 SECONDS. THE CAR WAS BROUGHT IN, AND THE HIGH PRESSURE FUEL PUMP WAS FOUND TO BE FAULTY. REPLACED BY DEALER FREE OF CHARGE.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10231557,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1211947200000-0400)/",
      "DateComplaintFiled": "/Date(1213848000000-0400)/",
      "VIN": "WBAWL73528P",
      "Component": "FUEL SYSTEM, GASOLINE",
      "Summary": "FUEL PUMP REPLACED AFTER 188 MILES. CAR ALREADY SHOWED SYMPTOM 1 DAY AFTER DELIVERY. HESITATED TO START. DEALER DIAGNOSED DEFECTIVE FUEL PUMP AND REPLACED IT.\r\nIMPORTANT NOTE TO CAR. IT IS A 335I, MODEL TYPE E93. YOUR SYSTEM DOESN'T LIST IT, SO I USED M3.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10236429,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1217044800000-0400)/",
      "DateComplaintFiled": "/Date(1217390400000-0400)/",
      "VIN": "WBAVB73598F",
      "Component": "FUEL SYSTEM, GASOLINE | FUEL SYSTEM, GASOLINE:DELIVERY:FUEL PUMP",
      "Summary": "ON SATURDAY, JULY 26TH, I DROVE A SHORT DISTANCE FROM MY HOME (AFTER A LONG CRANKING START) AND THE CAR SEEMED DRIVE NORMALLY UNTIL I TURNED TO ENTER A SHOPPING CENTER(FORTUNATELY, A SHORT DISTANCE FROM MY HOME, AS IT TURNS OUT). WHILE DRIVING INTO THE SHOPPING CENTER ENTRANCE (10 OR 15 MILES PER HOUR) I FELT A JOLT AND THE CAR SLOWED DRAMATICALLY.  I CHECKED THE REARVIEW MIRROR TO SEE IF I HAD BEEN HIT BY ANOTHER CAR, BUT HAD NOT.  I THEN REALIZED THAT THE ENGINE WAS NOT RUNNING, PUT IN THE CLUTCH AND COASTED TO A STOP AT A STOP SIGN.  I ATTEMPTED TO RE-START THE CAR BUT WAS UNABLE TO.  THE ENGINE ¿TURNED OVER¿ BUT WOULD NOT START. THERE WERE NO WARNING LIGHTS OR MESSAGES BEFORE OR AFTER THE FAILURE OR AT ANY OTHER TIME.  AT THIS POINT, I USED BMW ASSIST TO GET HELP SINCE I WAS PARTIALLY BLOCKING A BUSY INTERSECTION WITHIN THE SHOPPING CENTER.   A TOW TRUCK  ARRIVED ABOUT 45 MINUTES AFTER MY CALL TO BMW ASSIST.   WHEN THE TOW TRUCK ARRIVED, THE DRIVER POINTED OUT A LEAK AND PUDDLE/STAIN ON THE ASPHALT COMING FROM THE FRONT OF THE CAR.  THE STAIN WAS ABOUT 2 BY 3 FEET.  THERE WAS ALSO A SMELL OF GASOLINE.   WHEN THE CAR WAS TOWED TO THE DEALERSHIP, THE SERVICE ADVISOR ALSO NOTICED GAS STILL LEAKING FROM THE FRONT OF THE CAR AND DRIPPING ON THE GROUND.  A LOANER CAR AND I WAS ON MY WAY.  \r\n\r\nON MONDAY, JULY 28TH I CALLED THE SA TO CHECK THE STATUS OF THE CAR AT ABOUT 3:00 PM.  I WAS TOLD THAT THE HIGH PRESSURE FUEL PUMP AND A CONNECTING HOSE NEEDED TO BE REPLACED.  HE SAID THE PARTS WERE ORDERED AND SHOULD BE ON HAND BY WEDNESDAY, JULY 30 TO BE INSTALLED.  I ASKED ABOUT THE HOSE, AND THE RESULTING GASOLINE LEAK AND HE COMMENTED ABOUT THE LARGE AMOUNT OF GAS THAT HAD BEEN SPRAYED OUT IN THE ENGINE COMPARTMENT DUE TO THE FAILURE OF THE HOSE. THERE EASILY COULD HAVE BEEN A CATASTROPHIC FIRE DUE TO THE MAGNITUDE OF THE GASOLINE LEAK.  THE DEALERSHIP WILL REPAIR THE PUMP AND HOSE UNDER WARRANTY. THE CAR IS A BMW 335I. *TR\r\n",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10237786,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1216526400000-0400)/",
      "DateComplaintFiled": "/Date(1218427200000-0400)/",
      "VIN": "WBAWB73538P",
      "Component": "FUEL SYSTEM, GASOLINE",
      "Summary": "CRUISING ON THE HIGHWAY, THE VEHICLE STARTS MISFIRING AND LOSES POWER. AFTERWARD THE ENGINE IS RUNNING ROUGH AND CONTINUES IN \"ENGINE FAILURE\" MODE WITH REDUCED POWER. PROBLEM DIAGNOSED AS HIGH PRESSURE FUEL PUMP FAILURE. FUEL PUMP REPLACED THREE TIMES IN THE LAST MONTH AND KEEPS FAILING WITH THE SAME SYMPTOMS. THE VEHICLE IS 2008 BMW 335I.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10257659,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1222833600000-0400)/",
      "DateComplaintFiled": "/Date(1233810000000-0500)/",
      "VIN": "WBSWD93578P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "I HAVE A BMW M3 WITH THE DCT TRANSMISSION. SINCE GETTING A SOFTWARE UPDATE TO FIX ANOTHER NHTSA ISSUE WITH THE TRANSMISSION, MY CAR WILL HAVE NO POWER AT ALL FOR A COUPLE SECONDS WHEN I SLOW DOWN TO AROUND 10MPH, AND THEN TRY TO ACCELERATE AGAIN. THIS LEADS TO A VERY DANGEROUS SITUATION WHEN CARS ARE COMING AT ME AND THE CAR DOES NOT MOVE. THIS OCCURS MAINLY WHEN THE DCT IS SET TO THE AUTOMATIC MODE. MANY OTHERS HAVE HAD THE SAME ISSUE. THIS OCCURS PRETTY MUCH EVERY TIME I SLOW DOWN TO AROUND 10-15MPH FROM 40MPH OR MORE. MANY PEOPLE HAVE TOLD THE DEALER AND WERE TOLD THIS IS NORMAL!! BMW IS AWARE OF THIS AND TOLD THE DEALERS IT'S NORMAL. MANY MORE COMPLAINTS CAN BE FOUND ON WWW.M3POST.COM/FORUMS. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10258239,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1225512000000-0400)/",
      "DateComplaintFiled": "/Date(1234242000000-0500)/",
      "VIN": "WBSWL93598P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "THERE IS AN ISSUE WITH THE M-DCT TRANSMISSION EQUIPPED ON MY VEHICLE.  THE PROBLEM OCCURS WHEN THE CAR IS BROUGHT TO A NEAR STOP SUCH AS AT AN INTERSECTION, AND THEN PRESSURE IS APPLIED TO THE ACCELERATOR TO TRY AND PULL AWAY QUICKLY.  IN THIS CASE THE VEHICLE WILL HESITATE FOR A LONG PERIOD OF TIME, POTENTIALLY LEAVING THE CAR UNRESPONSIVE FOR A FEW SECONDS WHILE COASTING SLOWLY INTO THE INTERSECTION WITH ONCOMING TRAFFIC BEARING DOWN.  THE MANUFACTURER CLAIMS THIS BEHAVIOR IS NORMAL FOR THE TRANSMISSION BUT IT IS CERTAINLY NOT SAFE.  ADDITIONALLY, THE PROBLEM WAS EXACERBATED BY A PRIOR SOFTWARE UPDATE WHOSE INTENTION WAS TO FIX OTHER PROBLEMATIC BEHAVIORS OF THE TRANSMISSION.  SO THE BEHAVIOR IS CLEARLY NOT GERMANE TO THE TRANSMISSION ITSELF, IT IS INSTEAD THE RESULT OF GLITCHY SOFTWARE WHICH THE MANUFACTURER SHOULD RIGHTLY BE OBLIGATED TO FIX.  I FIRMLY BELIEVE THAT THIS PROBLEM COULD ENDANGER THE LIVES OF THE OCCUPANTS OF MY VEHICLE AND SINCERELY HOPE IT CAN BE RECTIFIED IMMEDIATELY. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10258247,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1222833600000-0400)/",
      "DateComplaintFiled": "/Date(1234242000000-0500)/",
      "VIN": "WBSWD935X8P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "I HAVE NOTICED SINCE THE SAFETY RECALL ON THE M-DCT GEARBOX: THERE IS A SIGNIFICANT LAG OR HESITATION OF AT LEAST 2 SECOND BETWEEN APPLYING PRESSURE TO THE ACCELERATOR AND THE CLUTCH ENGAGING AND GIVING ACCELERATION TO THE WHEELS. THIS RESULTS IN A COMPLETE LOSS OF POWER AND CAUSES THE CAR TO JUST \"COAST\". THIS DOES NOT HAPPEN FROM A STAND-STILL, BUT OCCURS PRIMARILY WHEN THE CAR IS IN MOTION AT VIRTUALLY ALL RANGES OF SPEED, FROM ROLLING STOP THROUGH STANDARD ROAD SPEEDS OF ANY DEGREE . THE PROBLEM IS ACUTE IN \"D\" MODE, BUT OCCURS IN \"S\" MODE AS WELL IN 2ND GEAR.\r\n\r\nTHE RESULT OF THIS IS THAT YOU CAN PULL OUT INTO TRAFFIC AND RATHER THAN INCREASE YOUR ACCELERATION NORMALLY, THE CAR WILL JUST COAST WITH NO POWER. THIS IS EXTREMELY DANGEROUS AND I HAVE HAD SEVERAL NEAR MISSES WITH A CHANCE OF A CAR REAR ENDING ME BECAUSE THE GEARBOX IS FUNCTIONING LIKE THIS. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10258881,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "Yes",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1234587600000-0500)/",
      "DateComplaintFiled": "/Date(1234760400000-0500)/",
      "VIN": "WBSWL93578P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "AFTER SLOWING FOR A YIELD SIGN, PRESSED ACCELERATOR AND THERE WAS A DELAYED RESPONSE, FOLLOWED BY SUDDEN ACCELERATION. BUMPED TRUCK IN FRONT OF ME DURING THE SURGE. CAR BEHIND ME ALMOST REARENDED ME WHEN MY CAR DID NOT ACCELERATE. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10258255,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1217563200000-0400)/",
      "DateComplaintFiled": "/Date(1234242000000-0500)/",
      "VIN": "WBSWD93508P",
      "Component": "POWER TRAIN",
      "Summary": "THIS IS A PROBLEM WITH THE M-DCT AUTOMATED MANUAL TRANSMISSION IN THE E92 BMW M3. IT IS A RECURRING ISSUE AND IS A SAFETY ISSUE AS WELL. WHEN TRAVELING AT LOW SPEEDS, SAY WHEN COASTING AND WHEN THE TRANSMISSION IS IN IT'S D MODE (AUTOMATIC LIKE MODE), WHEN YOU QUICKLY TRANSITION FROM LIGHT BRAKING TO MEDIUM THROTTLE APPLICATION THE VEHICLE BECOMES COMPLETELY UNRESPONSIVE TO THE GAS PEDAL INPUT AND OFFERS NO ACCELERATION. AFTER A DELAY OF A SECOND OR SO THE CAR WILL REV A BIT, SLIP THE CLUTCH AND ACCELERATE STRONGLY. THIS OCCURRENCE IS NOT UNIVERSAL BUT IS COMMON. ANY TIME YOU MAKE SUCH A TRANSITION AND REQUIRE THE VEHICLE TO \"OBEY\" AND ACCELERATE AS PER YOUR USE OF THE GAS PEDAL THE VEHICLES MARKED LACK OF ACCELERATION CAN BE A SAFETY ISSUE. SUCH OBVIOUS CASES INCLUDE LANE CHANGES, INTERSECTIONS WITH A YIELD OR MERGING INTO TRAFFIC AFTER A TURN. THIS ISSUE IS WIDESPREAD ON INTERNET MESSAGE BOARDS FOR OWNERS OF THIS CAR. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10258828,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1230872400000-0500)/",
      "DateComplaintFiled": "/Date(1234760400000-0500)/",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": " I AM EXTREMELY TROUBLED BY ONE PARTICULAR PROBLEM I HAVE NOTICED FROM THE OUTSET: THERE IS A SIGNIFICANT LAG OR HESITATION OF AT LEAST 1 SECOND BETWEEN APPLYING PRESSURE TO THE ACCELERATOR AND THE CLUTCH ENGAGING AND GIVING ACCELERATION TO THE WHEELS. THIS DOES NOT HAPPEN FROM A STAND-STILL, BUT OCCURS PRIMARILY WHEN THE CAR IS IN MOTION AT VIRTUALLY ALL RANGES OF SPEED, FROM ROLLING STOP (5KM/HR OR LESS) THROUGH STANDARD ROAD SPEEDS OF ANY DEGREE (RESIDENTIAL 30-40KM/HR, CITY ROADS 50-70KM/HR, OR HIGHWAY 90KM/HR+). THE PROBLEM IS ACUTE IN ¿D¿ MODE, BUT OCCURS IN ¿S¿ MODE AS WELL. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10257488,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1233550800000-0500)/",
      "DateComplaintFiled": "/Date(1233723600000-0500)/",
      "VIN": "WBSWD93598P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "DURING A ROLLING STOP SITUATION WHICH IS FOLLOWED BY ANY ACCELERATION (SUCH AS A LEFT OR RIGHT HAND TURN), THERE IS A THROTTLE DELAY AND THE VEHICLE HAS THE FEELING OF AN \"ENGINE STALL\" AND LOSSES ALL POWER FOR 1-2 SECONDS WHILE IT SEARCHES FOR A GEAR.  THE PROBLEM IS CONSISTENT AND CAN BE RECREATED AT ANYTIME.\r\n\r\nTHE PROBLEM PRESENTS A SAFETY HAZARD IN TRAFFIC SITUATIONS BECAUSE YOU ARE UNABLE TO MOVE OUT OF THE WAY OF ONCOMING VEHICLES.\r\n\r\nTHERE ARE MULTIPLE COMPLAINTS FROM OWNERS ON THE INTERNET AND CONFIRMED AT THE DEALERSHIP.  THE MANUFACTURER CLAIMS IT IS NORMAL OPERATION FOR THE TRANSMISSION.  (TECHNICAL SERVICE BULLETIN SB SI B 28 07 08)  HOWEVER, MANY PEOPLE DID NOT EXPERIENCE THE PROBLEM UNTIL AFTER THEIR VEHICLE UNDERWENT A RECENT RECALL FOR TRANSMISSION SOFTWARE UPDATES. \r\n\r\nVEHICLE\r\n\r\n2008 BMW M3 WITH M DCT TRANSMISSION. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10259911,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1233982800000-0500)/",
      "DateComplaintFiled": "/Date(1235538000000-0500)/",
      "VIN": "WBSWD93548P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "I HAVE A 2008 BMW M3 EQUIPPED WITH THE DCT TRANSMISSION AND MY ISSUE IS THE LAG WITH 2-3 GEARS, THIS IS MY DAILY COMMUTER CAR AND FOR SOME ONE WHO IS STUCK IN STOP AND GO TRAFFIC FOR ABOUT 2 HOURS AND 45 MILES EACH WAY I CANT NOT DRIVE MY CAR ANY MORE BECAUSE OF THIS ISSUE. \r\nI'VE BECOME REALLY FRUSTRATED BY THIS BEHAVIOR. IT'S NOT AT ALL INTERMITTENT -- IT HAPPENS EVERY TIME THE CAR DROPS INTO 2ND GEAR WHEN SLOWING (AND NOT COMPLETELY STOPPING). DECELERATING TO TURN CORNERS IS AN EXERCISE IN FRUSTRATION (ESPECIALLY WITH PASSENGERS IN THE CAR) BECAUSE THE CAR WON'T ACCELERATE OUT OF THE CORNER RIGHT AWAY... AND IF IT DOES, IT DOES SO RAPIDLY, THROWING EVERYONE'S HEADS INTO THE HEADRESTS. I'VE TRIED UPSHIFTING TO THIRD GEAR, BUT THERE'S A LAG IN THAT AS WELL IF I'VE ALREADY GIVEN THE CAR SOME GAS. I'VE HAD THE FIRST SOFTWARE UPDATE PERFORMED WHICH HAS NOT DONE MUCH. *TR\r\n",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10260768,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1236056400000-0500)/",
      "DateComplaintFiled": "/Date(1236229200000-0500)/",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "I HAVE A 2008 BMW M3 WITH THE DCT TRANSMISSION.  THE TRANSMISSION ITSELF HAS MANY ERRORS IN SECOND GEAR.  IF YOU SLOW DOWN ALMOST TO A STOP AND PUT YOUR FOOT BACK ON THE ACCELERATOR, THE CAR WILL NOT RESPOND.  I'VE HAD THIS HAPPEN IN INTERSECTIONS WHILE TURNING LEFT BEFORE.  WHEN YOU'VE GOT CARS COMING AT YOU AT HIGH SPEED AND YOU'VE GOT NO POWER, IT WILL DEFINITELY GET YOUR HEART BEATING A LITTLE FASTER FOR A MINUTE.  IT'S ONLY A MATTER OF TIME BEFORE SOMEONE GETS KILLED BECAUSE OF THIS PROBLEM.  IT REALLY IS HIGHLY DANGEROUS.  THIS IS AN ONGOING PROBLEM THAT ANY DCT DRIVER CAN REPLICATE EASILY.  BMW NEEDS TO COME UP WITH A VIABLE SOLUTION EVEN IF IT MEANS HAVING TO REPLACE TRANSMISSIONS, AND IT NEEDS TO HAPPEN SOON.  FOR AS MUCH AS THE UPGRADE COSTS, IT SHOULD WORK THE WAY THEY ADVERTISE. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10263002,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1237867200000-0400)/",
      "DateComplaintFiled": "/Date(1237953600000-0400)/",
      "VIN": "WBSWD93588P",
      "Component": "POWER TRAIN",
      "Summary": "MY 2008 BMW M3 E92 RAPIDLY SLOWS WHEN THE DCT TRANSMISSION IS DOWNSHIFTING.  THE CAR LAGS AND HAS ALMOST STALLED SEVERAL TIMES IN THE MIDDLE OF THE ROAD INCREASING THE POSSIBILITY OF A CRASH.  BMW NORTH AMERICA CUSTOMER SERVICE HAS REFUSED TO ACCEPT THAT THERE IS A PROBLEM WITH THE DCT TRANSMISSION SOFTWARE FOR ALL OF THESE VIN PRODUCTION CARS.  ANY HELP WOULD BE MUCH APPRECIATED.  *TR\r\n\r\nTHANKS\r\nBRAD LARKIN",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10263966,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1238644800000-0400)/",
      "DateComplaintFiled": "/Date(1238644800000-0400)/",
      "VIN": "WBSWD93518P",
      "Component": "POWER TRAIN:MANUAL TRANSMISSION",
      "Summary": "2008 BMW M3 W/DCT - I WAS MAKING A LEFT HAND TURN AND HAD SLOWED TO MAYBE 5MPH WHEN TRAFFIC ON THE OTHER SIDE HAD OPENED ENOUGH TO MAKE THE TURN, I PRESSED ON THE GAS AND THE CAR DID NOTHING BUT CONTINUE TO ROLL AT ABOUT 5MPH TOWARDS THE DRIVEWAY IN THE ON-COMING LANES, WHERE THERE WAS ANOTHER VEHICLE QUICKLY APPROACHING. AFTER ABOUT 3-5 SECONDS OF HESITATION THE GEAR ENGAGED AND I WAS ABLE TO ACCELERATE INTO THE DRIVEWAY AND NARROWLY AVOID BEING BROADSIDED BY ON-COMING TRAFFIC. HAD THE HESITATION BEEN FOR ANY LONGER, TRAFFIC BEEN MOVING ANY FASTER, OR THERE BEING ANY LESS OF A GAP IN TRAFFIC, I WOULD HAVE EITHER OF BEEN HIT, OR CAUSED THE ON-COMING DRIVERS TO HAVE LOCKED UP THEIR BRAKES POSSIBLY CAUSING THEM TO BE REAR-ENDED. THIS TRANSMISSION HESITATION IS INCREDIBLY UNSAFE AND IS ALWAYS A CAUSE FOR CONCERN IF MY SIGNIFICANT OTHER DRIVES THE VEHICLE. AT THIS POINT I REGRET NOT GETTING A STANDARD MANUAL WHERE I AM AT LEAST IN FULL CONTROL OF WHEN/IF THE CLUTCH ENGAGES AND AM IN MY SELECTED GEAR AS QUICKLY AS MY ARM CAN MOVE. THIS IS NOT THE FIRST TIME I HAVE EXPERIENCED THIS HESITATION, THIS HAS BEEN A CONSTANT ISSUE SINCE THE ORIGINAL RECALL NOTICE, I BELIEVE I HAVE SOFTWARE VERSION 31.2. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10261907,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1236916800000-0400)/",
      "DateComplaintFiled": "/Date(1237089600000-0400)/",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "I HAVE A 2008 BMW M3 WITH A DCT TRANSMISSION. THE VEHICLE CONSISTENTLY HAS A LAG WHEN ATTEMPTING TO ACCELERATE FROM ROLLING STOPS AND WHEN MERGING. I BELIEVE THIS COULD POTENTIALLY BE A SAFETY ISSUE DUE TO LOSS OF POWER AT THE WHEELS, ESP. IN HIGH SPEED SITUATIONS, IE WHEN TRYING TO MERGE ONTO BUSY HIGHWAYS. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10264753,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1239163200000-0400)/",
      "DateComplaintFiled": "/Date(1239163200000-0400)/",
      "VIN": "WBSWD93548P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "WHENEVER THE CAR IS MOVING AT SLOW SPEEDS, THERE IS A LAG BETWEEN THE MOMENT THE ACCELERATOR IS PRESSED AND THE TIME THE CAR ACTUALLY STARTS ACCELERATING.  THUS, DURING THIS LAG, THERE IS NO POWER TO THE CAR! THIS COULD BE VERY DANGEROUS! *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10265086,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1239595200000-0400)/",
      "DateComplaintFiled": "/Date(1239595200000-0400)/",
      "VIN": "WBSVA93588E",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "MY CAR IS EQUIPPED WITH THE \"DCT\" TRANSMISSION.  AT LOWER SPEEDS, THERE IS A DELAY OF 1+ SECONDS IN THROTTLE RESPONSE IN \"D MODE\" (SIMILAR TO AN AUTOMATIC MODE).  THIS HAS LEFT ME IN LIFE THREATENING SITUATIONS SEVERAL TIMES IN INTERSECTIONS WITH NO THROTTLE RESPONSE AND ONCOMING CARS.  I FEEL I CANNOT TRUST THE VEHICLE TO MOVE WHEN I NEED IT TO.  SOMEBODY IS GOING TO BE INJURED OR KILLED DUE TO THIS ISSUE.  I WAS NEARLY STRUCK ON TWO SEPARATE OCCASIONS.  I HAVE HAD THE CAR IN TO THE DEALER REPEATEDLY FOR THIS ISSUE AND AM ONLY REFERRED TO BMW SI B 28 07 08 AS AN EXPLANATION, WHICH IS TOTALLY UNACCEPTABLE!  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10265158,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1238990400000-0400)/",
      "DateComplaintFiled": "/Date(1239595200000-0400)/",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "THE CAR HAS A DANGEROUS THROTTLE LAG AT SLOW SPEEDS. WHEN TRYING TO MERGE ONTO FASTER TRAFFIC, IT CAUSES A DANGEROUS SITUATION WHERE THE CAR DOES NOT ACCELERATE FOR UP TO 2 SECONDS. ALMOST GOT REAR ENDED A COUPLE TIMES. THE CAR IS EQUIPPED WITH THE DCT TRANSMISSION, I HAVE RECENTLY GOTTEN A RECENT SOFTWARE UPDATE WHICH IS CAUSING THE PROBLEM TO OCCUR. BMW CURRENTLY IS NOT OFFERING A SOLUTION AND CALLING THE PROBLEM NORMAL. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10266854,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1235797200000-0500)/",
      "DateComplaintFiled": "/Date(1240804800000-0400)/",
      "VIN": "WBSWL93518P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "WHILE DECELERATING IN 2ND OR 1ST GEAR UNDER LIGHT BRAKING THEN ATTEMPTING TO ACCELERATE THE VEHICLE EXPERIENCES A LOSS OF POWER FOR TWO TO THREE SECONDS. MY FIRST EXPERIENCE WITH THIS HAPPENED MAKING A LEFT TURN ACROSS OPPOSING TRAFFIC LANE. HAD  ONCOMING TRAFFIC BEEN CLOSER WHEN THE VEHICLE DID NOT ACCELERATE I WOULD HAVE BEEN HIT MID SIDE OF THE VEHICLE. BMW REPORTS THAT THIS IS NORMAL BEHAVIOR OF THIS TRANSMISSION HOWEVER I FEEL IT IS A MAJOR SAFETY ISSUE. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10265334,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1219204800000-0400)/",
      "DateComplaintFiled": "/Date(1239681600000-0400)/",
      "VIN": "WBSWL93568P",
      "Component": "POWER TRAIN | POWER TRAIN:DRIVELINE",
      "Summary": "M3 WITH DCT AUTOMATED MANUAL TRANSMISSION WILL NOT SHIFT WHEN AT LOWER SPEEDS GOING AROUND CORNERS.  THERE IS A LONG DELAY BEFORE IT SHIFTS SO ITS DANGEROUS WHEN MERGING OUT INTO TRAFFIC.  THE CAR HAS PERFORMED THIS WAY SINCE PURCHASED AND MULTIPLE SOFTWARE REPROGRAMMING HAS NOT REMEDIED.\r\n\r\nWHEN TURNING THE REAR DIFFERENTIAL MAKES A GRINDING NOISE.  IT STARTED AT ABOUT 1200 MILES AND CONTINUES AT 5000 MILES.  THE DEALER PUT FLUID IN TO REMEDY AND SAID TO WAIT 300-500 MILES FOR IT TO GO AWAY.  THAT WAS OVER 1500 MILES AGO................. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10265025,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1239336000000-0400)/",
      "DateComplaintFiled": "/Date(1239508800000-0400)/",
      "VIN": "WBSWD93518P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "TIME DELAY IN SHIFTING OR LAG WHEN COMING TO A STOP AND TRYING TO ACCELERATE AGAIN. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10265050,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1225425600000-0400)/",
      "DateComplaintFiled": "/Date(1239508800000-0400)/",
      "VIN": "WBSWL93598P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "2008 BMW M3 DCT THE VEHICLE WAS RECALLED FOR A SOFTWARE UPDATE ON OCTOBER 2008. SINCE THEN THE CAR HAS A SEVERE LAG ISSUE UPON BRAKING THEN ACCELERATING AGAIN. THE THROTTLE DOES NOT RESPOND FOR A 1-2 SECONDS. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10265216,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1239595200000-0400)/",
      "DateComplaintFiled": "/Date(1239681600000-0400)/",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "ISSUE WITH THROTTLE NOT RESPONDING WITH THE DCT TRANSMISSION CAR (2008 BMW M3).  THIS IS A SOFTWARE PROBLEM THAT RENDERS THE CAR UNRESPONSIVE TO THROTTLE INPUT AND THEREFORE INCREASING THE RISK OF AN ACCIDENT. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10265062,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1239076800000-0400)/",
      "DateComplaintFiled": "/Date(1239595200000-0400)/",
      "VIN": "WBSWL93588P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "I HAVE A 08 BMW M3 WITH DCT TRANSMISSION. IT RECEIVED A SOFTWARE UPDATE MONTHS AGO TO FIX A TRANSMISSION SHIFTING PATTERN. IT DID SOLVE THAT ISSUE BUT IT CREATED A MUCH WORSE ONE. THE CAR NOW, WHEN DECELERATING FROM NORMAL SPEEDS AND REACHES A SPEED WHERE IT SHOULD BE ENGAGING INTO 2ND GEAR, IT DOES NOT FOR ABOUT 1-2 SECONDS. THIS HAPPENS EVERY TIME. THE CLASSIC EXAMPLE IS WHEN I SLOW DOWN AT AN INTERSECTION, COME OUT OF STREET AND MERGE INTO TRAFFIC, TRY TO MAKE A U-TURN, TURN INTO A BUSINESS ETC. THIS CREATES A SCENARIO THAT IF YOU ARE AT A BUSY ROAD AND LETS SAY DOING 45 MPH AND YOU SLOW DOWN TO MAKE A LEFT TURN TO A SLOW SPEED THAT YOU CAR SHOULD ENGAGE 2 OR 3RD GEAR AND IT SITS THERE FOR A SECOND OR TWO AND IT SEEMS TO BE \"LOOKING\" FOR A GEAR TO CHOOSE AND IT SIMPLY DOES NOT RESPOND. TO TRY TO COMPENSATE, THE NATURAL REACTION IS TO STEP ON THE GAS A BIT MORE TO MAKE IT THROUGH THE INTERSECTION. THE CAR THEN, WHEN IT DECIDES TO ENGAGE 2ND GEAR, LURCHES FORWARDS IN A VERY ABRUPT MANNER. THIS CREATES A VERY DANGEROUS SCENARIO SINCE THAT PAUSE IS A GREAT DEAL OF DISTANCE TRAVELED BY THE CAR BEHIND YOU AND IT KEEPS GOING. THE LAG IN THE TRANSMISSION CREATES DRASTIC VOID IN POWER AND THERE YOU SIT LIKE A FISH IN A BARREL HOPING A CAR OR AN 18-WHEELER DOES NOT HIT YOU FROM BEHIND. I HAVE HAD 3 VERY CLOSE TIMES MAKING A U-TURN IN A BUSY STREET THAT MY CAR WAS  EXTREMELY CLOSE TO BEING REAR ENDED WITH A CHILD IN THE BACK SEAT! ONCE IT CREATED ROAD RAGE WITH THE DRIVER OF THE TRUCK THAT ALMOST HIT ME AND THE OTHER PERSON ENDED UP IN THE MEDIAN AS TO NOT HIT ME. BMW HAS CHOSEN TO BE NON-COMMUNICATIVE WITH ITS CUSTOMERS AND EVEN STATING THAT THIS IS NORMAL FOR A DCT TRANSMISSION WHICH IS NOT. THIS DID NOT EXIST BEFORE THE LAST SOFTWARE UPDATE 31.2. IT IS VERY CONCERNING THAT BMW HAS TAKING THIS STANCE. I 'M AN AVID AUTO ENTHUSIAST & AN ER DOC AND TRUST ME THIS IS VERY DANGEROUS AND SOMEONE WILL BE KILLED IN AN ACCIDENT IF THEY DO NOT FIX THIS SOON PLEASE HELP! *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10274382,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1244433600000-0400)/",
      "DateComplaintFiled": "/Date(1245384000000-0400)/",
      "VIN": "WBSVA93568E",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "I HAVE A 2008 BMW M3 WITH THE DCT TRANSMISSION. EVER SINCE BMW INSTALLED A SOFTWARE UPDATE TO FIX A SIMILAR NHTSA ISSUE WITH THE TRANSMISSION, MY CAR SUFFERS FROM A SUDDEN POWER LOSS WHEN I SLOW DOWN TO APPROXIMATELY 10MPH, AND THEN TRY TO ACCELERATE AGAIN. THIS LEADS TO A VERY DANGEROUS SITUATION WHILE THE CAR DOES NOT MOVE AND TRAFFIC AROUND ME CONTINUES TO MOVE. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10275817,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1222660800000-0400)/",
      "DateComplaintFiled": "/Date(1246852800000-0400)/",
      "VIN": "WBSWD93598P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "I HAVE THE DCT TRANSMISSION WITH MY 2008 BMW M3 AND THE LAG IS VERY UNSAFE. DEALER SAYING NO FIX AND PROBLEM NOT UNSAFE. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10277593,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1247803200000-0400)/",
      "DateComplaintFiled": "/Date(1248148800000-0400)/",
      "VIN": "WBSWD93538P",
      "Component": "POWER TRAIN:MANUAL TRANSMISSION",
      "Summary": "2008 M3 DCT LAG PROBLEM. AT LOWER SPEEDS THE GEARBOX TAKES TO MUCH TIME TO SELECT A GEAR (LIKE COMING THROUGH A SLOW CORNER) AND THEN AFTER THE LAG AND IT \"CATCHES\" AGAIN THERE IS USUALLY A JERKY ACCELERATION. THIS IS NOT NORMAL FOR A TRANSMISSION TO DRIVE THIS WAY. HAPPENS MORE IN \"D\" MODE BUT ALSO IN REGULAR MODE ESPECIALLY IN 2ND GEAR. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10280322,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1249099200000-0400)/",
      "DateComplaintFiled": "/Date(1250136000000-0400)/",
      "VIN": "WBSWD93538P",
      "Component": "POWER TRAIN",
      "Summary": "MY M3 WITH M-DCT TRANSMISSION HAS SIGNIFICANT THROTTLE DELAY IN LOWER GEARS AT ROLLING SPEEDS.  CAR WOULD NOT RESPOND TO THROTTLE INPUT FOR ONE SECOND OR MORE AND THEN SUDDENLY SURGE FORWARD.  THIS IS A SIGNIFICANT SAFETY ISSUE AS THE CAR FAILS TO ACCELERATE WHEN NEEDED. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10284611,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1246334400000-0400)/",
      "DateComplaintFiled": "/Date(1253332800000-0400)/",
      "VIN": "WBSVA935X8E",
      "Component": "POWER TRAIN | POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "I HAVE A 2008 BMW M3 SEDAN, BUILT 2/08, WHICH I BOUGHT NEW IN JULY, 2008.  IT HAS A DUAL CLUTCH TRANSMISSION.  THE PROBLEM IS AS FOLLOWS.  THERE IS A SIGNIFICANT HESITATION OR DELAY BETWEEN STEPPING ON THE GAS, AND GETTING THE CAR TO GO, WHEN I HAVE SLOWED ALMOST TO A STOP, THEN WANT TO ACCELERATE.  THIS HAPPENS ALL THE TIME.  IT IS DANGEROUS ESPECIALLY WHEN MERGING INTO TRAFFIC.  IN WYOMING IN LATE JUNE, 2009, FOR EXAMPLE, I WAS COMING FROM A SIDE ROAD ONTO A MAIN HIGHWAY.  THERE WAS NO STOP SIGN FOR ME, JUST A RIGHT CURVE IN THE ROAD I WAS ON, THEN MERGE INTO ONCOMING TRAFFIC ON THE MAIN HIGHWAY.  THE TRANSMISSION HAD SHIFTED INTO SECOND GEAR BECAUSE I HAD SLOWED DOWN FOR THE CURVE.  AS I TURNED RIGHT AND STEPPED ON THE GAS, NOTHING, IT SEEMED LIKE FOR A SECOND OR TWO.  ONCOMING TRAFFIC WAS MOVING ALONG AT A FAST SPEED, AND I ALMOST GOT REAR-ENDED BEFORE THE MOTOR FINALLY RESPONDED TO THROTTLE INPUT.  I THINK THIS IS DANGEROUS.  WHEN I STEP ON THE GAS, THE MOTOR SHOULD RESPOND IMMEDIATELY, WITHOUT ANY SIGNIFICANT LAG TIME.  IT SEEMS LIKE SOME COMPUTER IS TRYING TO FIGURE OUT WHAT TO DO.  MAYBE THERE IS A SOFTWARE FIX.  WHATEVER IT IS, IT IS A DANGEROUS CONDITION. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10295122,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1243828800000-0400)/",
      "DateComplaintFiled": "/Date(1260334800000-0500)/",
      "VIN": "WBSWD93508P",
      "Component": "ENGINE AND ENGINE COOLING:ENGINE",
      "Summary": "UPON SLOWING DOWN, THEN ATTEMPTING TO RESUME POWER, THE ELECTRONIC THROTTLE  LAGS FOR SEVERAL SECONDS .  WHEN TURNING LEFT ACROSS TRAFFIC, THIS LAG LEAVES THE VEHICLE IN THE PATH OF ONCOMING TRAFFIC.  THIS OCCURS EVERY TIME THE VEHICLE IS SLOWED. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10298037,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1220241600000-0400)/",
      "DateComplaintFiled": "/Date(1262581200000-0500)/",
      "VIN": "WBSWD935X8P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "I AM VERY HAPPY TO SEE YOUR ORGANIZATION TAKING AN INTEREST IN THIS ISSUE. IT IS A VERY DANGEROUS PROBLEM WITH THIS VEHICLE THAT BMWNA IS WELL AWARE OF, BUT INSISTS THAT IT IS \"NORMAL BEHAVIOR\" FOR MY CAR/TRANSMISSION. I BROUGHT THE CAR INTO THE DEALER, AND THEY WERE ABLE TO REPRODUCE IT, BUT THEY WERE TOLD BY BMW THAT THIS WAS \"NORMAL BEHAVIOR.\"\r\n\r\nTHE PROBLEM OCCURS WHEN YOU SLOW DOWN- LIKE FOR A TURN, BUT DO NOT COME TO A COMPLETE STOP. THE DCT TRANSMISSION SEEMS TO HAVE TROUBLE FIGURING OUT WHAT GEAR TO SELECT BECAUSE WHEN YOU STEP ON THE GAS TO ACCELERATE, THERE IS A VERY SIGNIFICANT DELAY IN THE ONSET OF POWER- UP TO 2-3 SECONDS. BY THIS TIME, THE DRIVER IS USUALLY REALLY DIGGING INTO THE THROTTLE. THE TRANSMISSION FINALLY PICKS A GEAR, WHICH RESULTS IN THE CAR SUDDENLY LURCHING FORWARD, SOMETIMES INVOKING THE ANTI-SKIP CONTROL. \r\n\r\nTHE DANGER IN THIS BEHAVIOR OCCURS WHEN MAKING A TURN INTO ON-COMING TRAFFIC AFTER SLOWING DOWN TO AROUND 10-15 MPH. AFTER THE TURN, THE CAR IS POSITIONED IN THE TRAFFIC LANE, BUT YOU HAVE NO POWER TO ACCELERATE INTO THE FLOW OF TRAFFIC. THE ONCOMING CARS ARE NOW CLOSING IN ON YOUR CAR AT A FAST RATE, AND YOU'RE BASICALLY STUCK. THIS SITUATION IS MOST PRONOUNCED IN THE \"AUTO\" MODE OF THE DCT TRANSMISSION, BUT ALSO OCCURS TO A LESSER DEGREE WHILE IN THE MANUAL MODE WHEN YOU SELECT SECOND GEAR IN PREPARATION FOR THE TURN. IT IS ALSO VERY REPEATABLE IN BOTH MODES.\r\n\r\nTHESE PROBLEMS STARTED OCCURRING AFTER A PREVIOUS RECALL ON THIS TRANSMISSION WHERE THE ENGINE WOULD STALL UNDER HARD BRAKING OR NOT SHIFT UNDER HARD BRAKING. THE RECALL FIXED THAT PROBLEM, BUT INTRODUCED THIS PROBLEM, WHICH OCCURS ALMOST EVERY DAY WHEREAS THE PREVIOUS PROBLEM ONLY OCCURRED DURING A SPECIFIC SITUATION.\r\n\r\nTHANK YOU FOR LOOKING INTO THIS DANGEROUS MATTER. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10302125,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1264222800000-0500)/",
      "DateComplaintFiled": "/Date(1264395600000-0500)/",
      "VIN": "WBSWD93578P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "SHIFTING INTO 2ND GEAR PRODUCES LAG AND UPON ACCELERATING THE CAR JERKS AND JUMPS FORWARD, WHICH IS SCARY IN TRAFFIC AND ABSOLUTELY A BIG SAFETY ISSUE! *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10312939,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1263445200000-0500)/",
      "DateComplaintFiled": "/Date(1266901200000-0500)/",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "2008 E92 M3 WITH M-DCT TRANSMISSION.  TRANSMISSION TENDS TO \"LAG\" AFTER MEDIUM TO HARD BRAKING CAUSING UNRESPONSIVENESS TO THROTTLE FOR 2-3 SECONDS BEFORE EITHER 1)SLOWLY REGAINING THROTTLE, OR 2)SUDDEN FORWARD JERK.  BMW HAS TRIED UPDATING THE M-DCT SOFTWARE, WHICH SEEMED TO FIX THE PROBLEM TEMPORARILY BEFORE STARTING TO OCCUR AGAIN. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10312891,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1266728400000-0500)/",
      "DateComplaintFiled": "/Date(1266814800000-0500)/",
      "VIN": "WBSWD93508P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "DESPITE MULTIPLE SOFTWARE UPDATES TO CORRECT THIS FLAW MY M-DCT (AUTOMATED MANUAL TRANSMISSION) CAR STILL EXHIBITS A DELAY BETWEEN THROTTLE APPLICATION AND ANY RESPONSE FROM THE VEHICLE. FOR A SMALL PERIOD OF TIME THE VEHICLE IS UTTERLY UNRESPONSIVE TO THE THROTTLE INPUT. THIS HAPPENS WHEN ATTEMPTING TO ACCELERATE IMMEDIATELY AFTER COMING TO A NEAR STOP. THE LACK OF ACCELERATION CAN BE A SAFETY HAZARD IN MANY CASES. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10313479,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1266728400000-0500)/",
      "DateComplaintFiled": "/Date(1266901200000-0500)/",
      "VIN": "WBSWD93548P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "HESITATION IN THE AUTOMATIC MODE WHEN DECREASING SPEED THEN TRYING TO INITIATE A TURN.\r\nFOR EXAMPLE GOING DOWN THE ROAD AT 50MPH THEN BRAKING TO TURN LEFT, ONCE BRAKING OCCURS\r\nA SIGNIFICANT HESITATION WILL OCCUR  WHICH MAY RESULT IN THE ONCOMING TRAFFIC HITTING YOU. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10324666,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1270612800000-0400)/",
      "DateComplaintFiled": "/Date(1270785600000-0400)/",
      "VIN": "WBSWD93578P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "I AM VERY HAPPY TO SEE YOUR ORGANIZATION TAKING AN INTEREST IN THIS ISSUE. IT IS A VERY DANGEROUS PROBLEM WITH THIS VEHICLE THAT BMWNA IS WELL AWARE OF, BUT INSISTS THAT IT IS \"NORMAL BEHAVIOR\" FOR MY CAR/TRANSMISSION. I BROUGHT THE CAR INTO THE DEALER, AND THEY WERE ABLE TO REPRODUCE IT, BUT THEY WERE TOLD BY BMW THAT THIS WAS \"NORMAL BEHAVIOR.\"\r\n\r\nTHE PROBLEM OCCURS WHEN YOU SLOW DOWN- LIKE FOR A TURN, BUT DO NOT COME TO A COMPLETE STOP. THE DCT TRANSMISSION SEEMS TO HAVE TROUBLE FIGURING OUT WHAT GEAR TO SELECT BECAUSE WHEN YOU STEP ON THE GAS TO ACCELERATE, THERE IS A VERY SIGNIFICANT DELAY IN THE ONSET OF POWER- UP TO 2-3 SECONDS. BY THIS TIME, THE DRIVER IS USUALLY REALLY DIGGING INTO THE THROTTLE. THE TRANSMISSION FINALLY PICKS A GEAR, WHICH RESULTS IN THE CAR SUDDENLY LURCHING FORWARD, SOMETIMES INVOKING THE ANTI-SKIP CONTROL. \r\n\r\nTHE DANGER IN THIS BEHAVIOR OCCURS WHEN MAKING A TURN INTO ON-COMING TRAFFIC AFTER SLOWING DOWN TO AROUND 10-15 MPH. AFTER THE TURN, THE CAR IS POSITIONED IN THE TRAFFIC LANE, BUT YOU HAVE NO POWER TO ACCELERATE INTO THE FLOW OF TRAFFIC. THE ONCOMING CARS ARE NOW CLOSING IN ON YOUR CAR AT A FAST RATE, AND YOU'RE BASICALLY STUCK. THIS SITUATION IS MOST PRONOUNCED IN THE \"AUTO\" MODE OF THE DCT TRANSMISSION, BUT ALSO OCCURS TO A LESSER DEGREE WHILE IN THE MANUAL MODE WHEN YOU SELECT SECOND GEAR IN PREPARATION FOR THE TURN. IT IS ALSO VERY REPEATABLE IN BOTH MODES.\r\n\r\nTHESE PROBLEMS STARTED OCCURRING AFTER A PREVIOUS RECALL ON THIS TRANSMISSION WHERE THE ENGINE WOULD STALL UNDER HARD BRAKING OR NOT SHIFT UNDER HARD BRAKING. THE RECALL FIXED THAT PROBLEM, BUT INTRODUCED THIS PROBLEM, WHICH OCCURS ALMOST EVERY DAY WHEREAS THE PREVIOUS PROBLEM ONLY OCCURRED DURING A SPECIFIC SITUATION.\r\n\r\nTHANK YOU FOR LOOKING INTO THIS DANGEROUS MATTER. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10328416,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1260421200000-0500)/",
      "DateComplaintFiled": "/Date(1272772800000-0400)/",
      "VIN": "WBSWD93518P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "THE PROBLEM OCCURS WHEN YOU SLOW DOWN- LIKE FOR A TURN, BUT DO NOT COME TO A COMPLETE STOP. THE DCT TRANSMISSION SEEMS TO HAVE TROUBLE FIGURING OUT WHAT GEAR TO SELECT BECAUSE WHEN YOU STEP ON THE GAS TO ACCELERATE, THERE IS A VERY SIGNIFICANT DELAY IN THE ONSET OF POWER- UP TO 2-3 SECONDS. BY THIS TIME, THE DRIVER IS USUALLY REALLY DIGGING INTO THE THROTTLE. THE TRANSMISSION FINALLY PICKS A GEAR, WHICH RESULTS IN THE CAR SUDDENLY LURCHING FORWARD, SOMETIMES INVOKING THE ANTI-SKIP CONTROL. \r\n\r\nTHE DANGER IN THIS BEHAVIOR OCCURS WHEN MAKING A TURN INTO ON-COMING TRAFFIC AFTER SLOWING DOWN TO AROUND 10-15 MPH. AFTER THE TURN, THE CAR IS POSITIONED IN THE TRAFFIC LANE, BUT YOU HAVE NO POWER TO ACCELERATE INTO THE FLOW OF TRAFFIC. THE ONCOMING CARS ARE NOW CLOSING IN ON YOUR CAR AT A FAST RATE, AND YOU'RE BASICALLY STUCK. THIS SITUATION IS MOST PRONOUNCED IN THE \"AUTO\" MODE OF THE DCT TRANSMISSION, BUT ALSO OCCURS TO A LESSER DEGREE WHILE IN THE MANUAL MODE WHEN YOU SELECT SECOND GEAR IN PREPARATION FOR THE TURN. IT IS ALSO VERY REPEATABLE IN BOTH MODES. *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10343436,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1279166400000-0400)/",
      "DateComplaintFiled": "/Date(1279166400000-0400)/",
      "VIN": "WBSWL93508P",
      "Component": "POWER TRAIN:AUTOMATIC TRANSMISSION",
      "Summary": "I OWN A 2008 BMW M3 WITH DCT TRANSMISSION. WHEN IN AUTO MODE AND YOU SLOW DOWN AND THEN WISH TO ACCELERATE THE CAR HESITATES AND THEN LUNGES FORWARD. THIS IS GOING TO CAUSE A PROBLEM WITH LOSING CONTROL OF THE CAR OR COULD CRASH INTO VEHICLE IN FRONT OF YOU. TOOK IT TO THE DEALER AND THEY SAID NOTHING IS WRONG. THEIR NEEDS TO BE A RECALL ON THIS. VIN NUMBER [XXX].\r\nINFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10463954,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1334289600000-0400)/",
      "DateComplaintFiled": "/Date(1341201600000-0400)/",
      "VIN": "WBSWD93568P",
      "Component": "POWER TRAIN",
      "Summary": "THERE'S AN ISSUE WITH THE CAR'S DCT/TRANSMISSION. THE PROBLEM OCCURS WHEN YOU SLOW DOWN- LIKE FOR A TURN, BUT DO NOT COME TO A COMPLETE STOP. THE DCT TRANSMISSION SEEMS TO HAVE TROUBLE FIGURING OUT WHAT GEAR TO SELECT BECAUSE WHEN YOU STEP ON THE GAS TO ACCELERATE, THERE IS A VERY SIGNIFICANT DELAY IN THE ONSET OF POWER- UP TO 2-3 SECONDS. BY THIS TIME, THE DRIVER IS USUALLY REALLY DIGGING INTO THE THROTTLE. THE TRANSMISSION FINALLY PICKS A GEAR, WHICH RESULTS IN THE CAR SUDDENLY LURCHING FORWARD, SOMETIMES INVOKING THE ANTI-SKIP CONTROL. \r\n\r\nTHIS HAS HAPPENED SEVERAL TIMES SINCE I BOUGHT THE VEHICLE AND CAN PROVE TO BE VERY DANGEROUS WHEN YOU'RE IN CLOSE PROXIMITY TO ANOTHER CAR AND THE CAR THRUSTS FORWARD.      *JS",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10525919,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1371960000000-0400)/",
      "DateComplaintFiled": "/Date(1374292800000-0400)/",
      "VIN": "WBSWD935X8P",
      "Component": "ENGINE",
      "Summary": "THE ENGINE IN MY BMW DIED AT 74,598 MILES, NO WARNING LIGHTS AND NO WEIRD NOISES. IT DIED WHEN I WAS DRIVING THE SPEED LIMIT (65) ON THE HIGHWAY DOING NOTHING OUT OF THE ORDINARY, WHEELS LOCKED UP IN TRAFFIC SO I HAD TO PUSH IN CLUTCH. IT WAS A VERY LIFE THREATENING SITUATION BECAUSE A BIG RIG ALMOST CRASHED INTO MY CAR. I COASTED TO THE SIDE OF THE HIGHWAY TO CHECK IT OUT: THE ENGINE WAS NOT OVERHEATING AND THERE WAS NO FLUIDS ON THE GROUND. AS I TRIED STARTING THE CAR UP AGAIN I COULD HEAR THE FUEL PUMP TURNING ON AND THE STARTER MOTOR CLICKING, BUT THE ENGINE WOULDN'T TURN OVER. I GOT THE CAR TOWED TO THE DEALERSHIP AND A FEW DAYS LATER IT WAS MADE KNOWN TO ME BY THE DEALERSHIP THAT MY ENGINE WAS SEIZED AND THAT I WOULD HAVE TO PAY $19,000 FOR A NEW ENGINE AND $6,000 FOR THE LABOR TO INSTALL IT. I MADE THE DEALERSHIP AWARE THAT I KEPT UP WITH THE MAINTENANCE, AND THAT NOTHING WAS INDICATING TO ME THAT MY ENGINE WAS ABOUT TO FAIL. I INSTRUCTED THE DEALERSHIP TO CONTACT BMW NORTH AMERICA (BMW HEADQUARTERS FOR NORTH AMERICA) FOR A \"GOOD WILL\" REPLACEMENT, BUT MY REQUEST WAS DENIED. THIS PROBLEM IS DIRECTLY RELATED TO THE ROD BEARING INSIDE THE ENGINE, WHICH GAVE OUT BECAUSE THERE IS NO ADEQUATE LUBRICATION TO THEM, I HEARD OF THESE ROD BEARINGS GIVING OUT ON THE S65 ENGINE ALL OVER WEB FORUMS, MULTIPLE PEOPLE HAVE HAD THIS HAPPEN TO THEM. DURING MY WARRANTY PERIOD I DID LET THEM KNOW THAT MY CAR WOULD GO IN LIMP MODE (LOW POWER MODE ON ENGINE, MAX SPEED ABOUT 40MPH) AND I WAS HEARING TICKING NOISES (DEALERSHIP SAID THIS WAS NORMAL) THAT WERE NOT PRESENT WHEN THE CAR WAS REALLY NEW (THE FIRST 5000 MILES I PUT ON THE CAR). THE DEALERSHIP AND BMW NORTH AMERICA DON'T CARE ABOUT THESE PROBLEMS WHICH WERE PRESENT DURING MY ENTIRE OWNERSHIP OF THE CAR (IN WARRANTY PERIOD) AND THEY DENIED THE FREE REPLACEMENT BECAUSE MY CAR IS NOW OUT OF WARRANTY.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10542898,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1378785600000-0400)/",
      "DateComplaintFiled": "/Date(1378785600000-0400)/",
      "VIN": "WBSWD93598P",
      "Component": "SERVICE BRAKES",
      "Summary": "IN A SITUATION WHERE THE CAR IS STOPPED AND LIGHT PRESSURE IS APPLIED TO THE BRAKE (HVAC IS OFF) THE IDLE OF THE CAR WILL FALL BELOW SPECIFICATION AND THE IDLE BECOMES ROUGH. EVEN A VERY SLIGHT DECREASE IN BRAKE PRESSURE WILL RETURN THE IDLE TO SPEC. THIS WOULD SEEM TO ME TO BE A PROBLEM WITH EITHER THE VACUUM BOOSTER OR THE MASTER CYLINDER. I HAVE NOTED MANY OTHERS WITH THE SAME SYMPTOMS IN ONLINE FORUMS. AT THE VERY LEAST IT IS AN EMISSIONS ISSUE AND AT WORST A SAFETY ISSUE. I AM PROMPTED TO LOG THIS COMPLAINT GIVEN TODAY'S NEWS OF 328I BRAKE INVESTIGATIONS. I HAVE CALLED BMWNA TO GET NO SATISFACTORY RESPONSE.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10559626,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1388379600000-0500)/",
      "DateComplaintFiled": "/Date(1389589200000-0500)/",
      "VIN": "WBSWL93548P",
      "Component": "ELECTRICAL SYSTEM:12V/24V/48V BATTERY | LATCHES/LOCKS/LINKAGES",
      "Summary": "TL* THE CONTACT OWNS A 2008 BMW M3. THE CONTACT STATED THAT THE DOORS FAILED TO UNLOCK, THE VEHICLE FAILED TO START, AND ALL THE ELECTRICAL COMPONENTS FAILED TO FUNCTION. THE CONTACT ALSO STATED THAT THE BATTERY WAS TESTED AND WAS IN WORKING CONDITION. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED ABOUT THE FAILURE. THE FAILURE MILEAGE WAS 16,000.    UPDATED 3/28/14*CN\r\nTHE CONSUMER STATED THE BATTERY WAS REPLACED. *JB",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10637297,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 1,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1410926400000-0400)/",
      "DateComplaintFiled": "/Date(1411012800000-0400)/",
      "VIN": "WBSWD93548P",
      "Component": "ELECTRONIC STABILITY CONTROL | POWER TRAIN | STEERING",
      "Summary": "INCIDENT 1\r\nI WAS MAKING A LEFT TURN AFTER THE SIGNAL AND ENTERING INTO THE FREEWAY AT 25 MPH, AND DURING THE TURN, THERE WAS A SLIGHT INCLINATION IN THE ROAD LIKE A BUMP AND  THE CAR LANDED ON THE FRONT RIGHT WHEEL AND IMMEDIATELY THE I LOST STEERING CONTROL AND HAD DSC (DYNAMIC STABILITY CONTROL) AND BRAKE WARNING AND I WAS THIS CLOSE TO GETTING RAMMED BY A TRUCK FROM BEHIND AND I HURT MY HAND DURING THIS EVENT BECAUSE I COULD HARDLY STEER MY CAR AND BARELY PULLED ON TO THE CURB OF THE FREEWAY. \r\nHOW CAN A BMW BE SO DELICATE, IT CANT HANDLE A BUMP AND IF IT CANNOT, THEN WHY DID I LOOSE STEERING CONTROL ?\r\n\r\nINCIDENT 2\r\n2 WEEKS  BEFORE THIS INCIDENT HAD A CLUTCH BEARING FAILURE, WHICH RESULTED IN THE CLUTCH PEDAL STUCK TO THE FLOOR AND DID AND RETRIEVE, I COULD NOT CHANGE THE GEAR AND ALMOST RAN INTO ANOTHER ACCIDENT BECAUSE THE CAR CAME TO A HALT IN THE MIDDLE OF THE ROAD.\r\n\r\n\r\nTHE VEHICLE IS PRE-CERTIFIED BY BMW AND IT'S BEEN ONLY 4 MONTHS SINCE I PURCHASED THE VEHICLE.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10702177,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1427428800000-0400)/",
      "DateComplaintFiled": "/Date(1427428800000-0400)/",
      "VIN": "WBSWD93528P",
      "Component": "AIR BAGS | ELECTRICAL SYSTEM | SEATS",
      "Summary": "PASSENGER RESTRAINT FAULT LIGHT CAME ON...SIMILAR PROBLEMS IN OTHER YEARS AND RECALLS FOR '06 MODEL YEAR BUT NOT THIS YEAR.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10712972,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1429848000000-0400)/",
      "DateComplaintFiled": "/Date(1430020800000-0400)/",
      "VIN": "WBSWD93558P",
      "Component": "ENGINE | POWER TRAIN",
      "Summary": "ENGINE BEGAN SUDDENLY MAKING A VERY LOUD KNOCKING SOUND WITHOUT ANY WARNING, AND I DROVE IT STRAIGHT TO SANDY SANSING BMW SERVICE CENTER, WHERE THEY STATED THAT THE VEHICLE HAS SUFFERED A CATASTROPHIC CRANK BEARING FAILURE.   THE ENGINE HAS TO BE REPLACED NOW...  CAR HAS BEEN METICULOUSLY MAINTAINED AND ALWAYS SERVICED AT BMW DEALERS SINCE IT WAS NEW...  A CAR WITH 56K MILES ON IT SHOULD NOT HAVE SUCH AN EXTREME FAILURE IN THIS NATURE...  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10730302,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1430798400000-0400)/",
      "DateComplaintFiled": "/Date(1435204800000-0400)/",
      "Component": "ENGINE | STEERING:LINKAGES:ROD:RELAY:CONNECTING",
      "Summary": "TL* THE CONTACT OWNS A 2008 BMW M3. WHILE DRIVING AT 60 MPH, THE CONTACT HEARD A SUDDEN KNOCKING SOUND AND THE VEHICLE STALLED. THE VEHICLE RESTARTED, BUT THE NOISE RECURRED. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS DIAGNOSED WITH ROD BEARING FAILURE AND THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE VIN AND FAILURE MILEAGE WERE UNAVAILABLE.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10748475,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1439265600000-0400)/",
      "DateComplaintFiled": "/Date(1439438400000-0400)/",
      "VIN": "WBSWD93518P",
      "Component": "ENGINE",
      "Summary": "AFTER INFORMING BMW NA MANY TIMES OF THE WIDESPREAD ROD BEARING PROBLEM ON THE S65 MOTOR THAT CAN CAUSE ENGINE FAILURE AND SEIZING OF THE ENGINE AT SPEED THEY REFUSE TO ASSIST  ME IN THIS MATTER. THIS WIDE SPREAD BEARING ISSUE HAS AFFECTED 100'S IF NOT 1000'S OF THESE ENGINES. AFTER MY ENGINE FAILED BMW REFUSED TO GOOD WILL ME A ENGINE FOR SMALL UNRELATED MISC. THINGS FOR EXAMPLE EXHAUST AND SUSPENSION. I'VE HAD THE BEARINGS REPLACED BY A REPUTABLE INDYSHOP THAT HAS DONE MANY ROD BEARING JOBS ON MY IDENTICAL CAR TYPE. I HAVE FAILED ORIGINAL BEARINGS IN HAND. AFTER PICKING UP MY CAR FROM THIS SHOP MY ENGINE SEIZED ON THE MIDDLE OF THE ROAD. ALTHOUGH THIS SHOP PERFORMED THE WORK PROPERLY ULTIMATELY THIS ENGINE WOULD HAVE SEIZED EITHER WAY. I AM NOW OUT A FEW THOUSAND DOLLARS FROM THE BEARING JOB AND I WILL NEED A NEW ENGINE. MY COMPLAINT IS TO BMW NORTH AMERICA IN ARBITRARILY DENYING MY CLAIM WHEN THEY ARE AWARE AND I HAVE PROOF THAT THE ENGINES THAT THEY PRODUCED FROM THE FACTORY HAVE INSUFFICIENT CLEARANCE TO LUBRICATE AND WITCH CAUSES FAILURE TO CARS BETWEEN 25,000 MILES OR 110,000 MILES. THERE IS A REGISTRY ONLINE OF MANY MANY M3'S WITH THIS ENGINE WITH THE SAME ENGINE FAILURE. IF MY ENGINE WERE TO HAVE SEIZED ON THE FREEWAY THIS MAY HAVE CAUSED A SERIOUS CRASH AS WELL AS A POSSIBILITY OF SERIOUS BODILY HARM INCLUDING DEATH. TO FURTHER CLARIFY ENGINE FAILURE WAS IMMINENT EVEN BEFORE THIS INDY SHOP PERFORMED THIS WORK. I AM NOW WITHOUT A CAR AND I WORK. I AM NOW FORCED TO BUY A NEW ENGINE FOR OVER $15,000 WITCH IS APPROX. THE VALUE OF THE CAR OR SELL THE VEHICLE FOR  A SUBSTANTIAL LOSS. BMW SHOULD HAVE DONE THE RIGHT THING HERE BUT INSTEAD DENIED MY REQUEST AND PUSHED ME OUT THE DOOR. BMW NA IS NOT TAKING RESPONSIBILITY FOR THIS WHEN THEY SHOULD. IF YOU LOOK INTO THE PREVIOUS MODEL M3 WITH S54 ENGINE THERE WAS A MAJOR ROD BEARING RECALL. SAME ISSUE HERE. \r\nTHANK YOU    *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10748491,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1435896000000-0400)/",
      "DateComplaintFiled": "/Date(1439438400000-0400)/",
      "VIN": "WBSWD93518P",
      "Component": "ENGINE",
      "Summary": "TL* THE CONTACT OWNS A 2008 BMW M3. WHILE DRIVING APPROXIMATELY 50 MPH, THERE WAS AN ABNORMAL NOISE COMING FROM THE FRONT OF THE VEHICLE. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE ROD BEARING AND THE ENGINE NEEDED TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS THEN TAKEN TO AN INDEPENDENT MECHANIC WHERE THE ROD BEARINGS WERE REPLACED. THE CONTACT MENTIONED THAT WHILE DRIVING APPROXIMATELY 30 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN BACK TO THE INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 96,000. ",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10810103,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1449896400000-0500)/",
      "DateComplaintFiled": "/Date(1450125417000-0500)/",
      "VIN": "WBSVA93548E",
      "Component": "ENGINE",
      "Summary": "DRIVING ON THE HIGHWAY IN 4TH GEAR, THE MOTOR SEIZED. THE PISTON ROD SNAPPED AND BLEW ALUMINUM PARTS THROUGH THE OIL PAN.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10817277,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "Yes",
      "Fire": "No",
      "NumberOfInjured": 1,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1451192400000-0500)/",
      "DateComplaintFiled": "/Date(1451538000000-0500)/",
      "VIN": "WBSWD935X8P",
      "Component": "AIR BAGS | VEHICLE SPEED CONTROL",
      "Summary": "TL* THE CONTACT OWNS A 2008 BMW M3. WHILE ACCELERATING, THE THROTTLE BECAME STUCK AND CAUSED THE REAR TIRES TO SPIN. THE CONTACT STRUCK A CURB, CRASHED INTO A TREE, AND THEN A FENCE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED A BACK INJURY THAT NEEDED MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO A TOWING LOT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 65,000.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10850868,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1447477200000-0500)/",
      "DateComplaintFiled": "/Date(1458595114000-0400)/",
      "VIN": "WBSVA935X8E",
      "Component": "ENGINE",
      "Summary": "THE ENGINE PISTON BEARING WORE OUT AT LESS THAN 60K MILES CAUSING DAMAGES TO THE ENGINE.  LUCKILY CAR ENGINGE DID NOT LOCK UP WHILE DRIVING OR COULD HAVE CAUSED TERRIBLE ACCIDENT IN FREEWAY",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 11012310,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1501560000000-0400)/",
      "DateComplaintFiled": "/Date(1501692206000-0400)/",
      "Component": "AIR BAGS",
      "Summary": "I HAVE BEEN TRYING TO REACH MY DEALER TO FIX THE STEERING WHEEL AIRBAG (TAKATA) AND THEY ARE STILL SAYING ' NO SOLUTION AVAILABLE YET' I NEED THIS FIXED TO FEEL SAFE DRIVING MY BMW AGAIN.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 11032277,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1487134800000-0500)/",
      "DateComplaintFiled": "/Date(1507509079000-0400)/",
      "VIN": "WBSVA93588E",
      "Component": "ENGINE",
      "Summary": "FAILED BEARINGS ENGINE HAD TO REPLACE ENGINE HAPPENED WHILE DRIVING ON THE HIGHWAY",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 11041511,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1498017600000-0400)/",
      "DateComplaintFiled": "/Date(1509427205000-0400)/",
      "Component": "ENGINE",
      "Summary": "CONNECTING ROD BEARING FAILURE. WELL MAINTAINED AT DEALERSHIP AND CERTIFIED INDY SHOP.  CRANKSHAFT WAS HEAVILY DAMAGED BECAUSE LACK OF OIL DUE TO INCORRECT BEARING AND CONNECTING ROD CLEARANCES FROM FACTORY.  ENGINE IS UNREPAIRABLE. CHECK BY BMW AND REFUSE TO ASSIST IN REPLACEMENT. CAR WAS STATIONARY AND HAD BEEN IDLING FOR 1 MIN.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 11046268,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1510203600000-0500)/",
      "DateComplaintFiled": "/Date(1510766087000-0500)/",
      "Component": "ENGINE",
      "Summary": "I WAS DRIVING FROM WORK AND HEARD A LOUD METAL KNOCKING NOISE COMING FROM THE ENGINE COMPARTMENT. I IMMEDIATELY STOPPED AND CALLED A TOW TRUCK. THE CAR WAS TOWED TO KUMMROW AUTOMOTIVE. THEY DIAGNOSED THAT THIS IS A CATASTROPHIC ROD BEARING FAILURE. HOW COULD THIS HAPPEN IN A CAR WITH A LITTLE OVER 60,000 MILES? I KNEW ABOUT THE POTENTIAL ROD BEARING ISSUE AND THE CLASS ACTION SUITS, BUT SINCE THIS ISSUE AFFECTS LESS THAN 1% OF THE VEHICLES AND SINCE I BOUGHT A VEHICLE THAT WAS NEVER TRACKED, BABIED ALL OF ITS LIFE, I FELT CONFIDENT I WASN'T GOING TO BE ONE OF THE UNLUCKY ONES.\r\n\r\nI AM EXTREMELY DISAPPOINTED IN THE WAY I WAS TREATED BY BMW NA AFTER SO MANY YEARS OF BEING A LOYAL CUSTOMER AND A BMW ENTHUSIAST. THE S65 (M3) AND S85 (M5) ENGINE ROD BEARING ISSUE HAS BEEN VERY WELL DOCUMENTED OVER THE YEARS.  I REPORTED THE ISSUE TO BMW NA AND CORRESPONDED WITH YOU AND SCOTT KUCHTA VIA EMAIL AS WELL AS ON THE PHONE. IT'S BEEN GOING BACK AND FORTH FOR OVER A WEEK. I SPOKE WITH SCOTT ON MONDAY AND HE INFORMED ME THAT BMW NA IS NOT AWARE OF ANY ROD BEARING ISSUES WITH MY ENGINE AND THAT SINCE THE CAR WASN'T MAINTAINED AT THE DEALER, BMW NA WON'T BE ABLE TO OFFER ANY ASSISTANCE. THE CAR WAS SERVICED AT BMW OF STERLING IN VA ALL OF ITS LIFE EXCLUSIVELY FROM 2008 THROUGH 2013. THE SECOND OWNER HAD THE CAR FROM 2013 THROUGH 2017 AND PUT 3,000 MILES ON IT. THATS IT! SO, HE DID ONE OIL CHANGE. THE CAR WAS BABIED ALL OF ITS LIFE. AS FAR AS THE ROD BEARING ISSUE, A SIMPLE SEARCH FOR THE ENGINE (S65) OR THE MODEL NUMBER (E92 M3) GENERATES PAGES AND PAGES OF INFORMATION ON THE SUBJECT. ANY BMW LICENSED OR INDEPENDENT MECHANIC IS VERY WELL AWARE OF THIS ISSUE. THIS IS VERY DISAPPOINTING AND DISCOURAGING THAT BMW NA WOULDN'T STAND UP TO ITS REPUTATION AND DO THE RIGHT THING HERE. THIS IS A VERY WELL-DOCUMENTED PROBLEM WITH THE S65 ENGINE. I AM HOPING BMW WILL DO THE RIGHT THING HERE.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 11096423,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1526443200000-0400)/",
      "DateComplaintFiled": "/Date(1526518843000-0400)/",
      "VIN": "WBSVA93508E",
      "Component": "AIR BAGS",
      "Summary": "TAKATA RECALL.  DESPITE MY HAVING RECEIVED 2 RECALL NOTICES REGARDING MY AIRBAG, AND MY CAR'S VIN BEING LISTED ON NHTSA.DOT.GOV AS BEING SUBJECT TO AN AIRBAG RECALL, THE BMW DEALER LISTED ON MY RECALL NOTICE, BMW OF MOUNTAIN VIEW, IN MOUNTAIN VIEW, CALIFORNIA, REFUSED TO DO THE RECALL REPAIR ON 5/16/2018 ON THE BASIS THAT THEIR COMPUTER SYSTEM SAID THERE WERE NO OPEN RECALLS ON THE VEHICLE.  THEY FURTHER SAID THAT THE RECALL NOTICE I RECEIVED MEANT THAT THEIR MIGHT BE A RECALL BUT THAT IN FACT THERE WAS NO RECALL.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 11098485,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1527566400000-0400)/",
      "DateComplaintFiled": "/Date(1527566400000-0400)/",
      "VIN": "WBSWD935X8P",
      "Component": "ELECTRICAL SYSTEM:WIRING:FRONT UNDERHOOD",
      "Summary": "TL* THE CONTACT OWNS A 2008 BMW M3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V676000 (ELECTRICAL SYSTEM); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (BASNEY BMW MAZDA, 52203 IN-933, SOUTH BEND, IN 46637, (574) 272-8504) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. ",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 11056674,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1514091600000-0500)/",
      "DateComplaintFiled": "/Date(1514330456000-0500)/",
      "VIN": "WBSWD93528P",
      "Component": "ELECTRONIC STABILITY CONTROL | ENGINE | VEHICLE SPEED CONTROL",
      "Summary": "I HAVE A BMW E92 CHASSIS.  I HAVE SPOKEN TO MANY, MANY OWNERS OF THE SAME BMW AND THEY HAVE SAID THE SAME THING.  THE THROTTLE BODY ACTUATORS ARE DEFECTIVE ON THESE BMWS.  WHEN THE MALFUNCTION TAKES PLACE THE BMW GOES INTO LIMP MODE.  THE CAR IS NOT ABLE TO REV ABOVE 3K RPM NOR GO A SPEED OF OVER 55 MPH.  THIS IS INCREDIBLY DANGEROUS ON THE INTERSTATE WHEN YOUR CAR DOES THIS.  I DID NOT FEEL SAFE AS WELL AS MANY PEOPLE I'VE TALKED TO AND THIS HAS HAPPENED TO THEM.  IT IS A KNOWN ISSUE ON THE E92 BMW AROUND 79,000 MILES.  THE BMW M3 OF THIS YEAR IS VERY POPULAR AND THERE ARE MANY OWNERS.  THE ROD BEARINGS ALSO GO OUT IN THIS CAR AND CREATE THE SAME SAFETY ISSUE.  I BELIEVE THE THROTTLE ACTUATORS AND ROD BEARINGS GOING BAD AND PUTTING THE CAR INTO LIMP MODE IS AN INCREDIBLY DANGEROUS ISSUE.  I HAVE CALLED BMW NA AND THEY WILL NOT LOOK INTO THEM AS THEY ARE NOT AN 'ACTIVE RECALL'.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 11057223,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1513314000000-0500)/",
      "DateComplaintFiled": "/Date(1514437200000-0500)/",
      "VIN": "WBSWL93528P",
      "Component": "ENGINE",
      "Summary": "CONNECTING ROD BEARING FAILURE WHILE DRIVING. STARTING MAKING A LOUD TICKING SOUND FROM THE BOTTOM END OF THE MOTOR.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 11055005,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1511326800000-0500)/",
      "DateComplaintFiled": "/Date(1513386529000-0500)/",
      "VIN": "WBSWL93518P",
      "Component": "ENGINE",
      "Summary": "RECEIVED A LOSS OF POWER WARNING FOR THE CAR.  TOOK IT TO THE SHOP, SHOP WAS UNABLE TO DIAGNOSE THE PROBLEM BUT STATED THAT IT WAS PROBABLY A BENT RED.  TOOK IT TO GET A SECOND OPINION.  NO COMPRESSION IN THE 4TH CYLINDER BUT THERE IS OBVIOUS CYLINDER WALL DEFORMATION AND SMALL PISTON SHRINKAGE.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 11066845,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "Yes",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1517202000000-0500)/",
      "DateComplaintFiled": "/Date(1517720400000-0500)/",
      "VIN": "WBSVA93528E",
      "Component": "ENGINE",
      "Summary": "I'VE BEEN DRIVING BMW FOR OVER 12 YEARS. MY ABSOLUTE FAVORITE CAR TO DRIVE. I'VE HAD MY M3 FOR A YEAR. MY DREAM CAR. I TOOK THE UPMOST CARE OF HER.  COMING HOME FROM WORK LATE MONDAY DRIVING AROUND 65-70 MILES PER HOUR.  I HEARD A LOUD NOISE FROM MY CAR AND AN ENGINE MALFUNCTION NOTIFICATION ON MY CAR. ALMOST HIT AN 18 WHEELER  AS MY CAR LOST CONTROL BEFORE I SWERVED INTO A DITCH.  HAD IT TOWED TO MY MECHANIC WHERE HE CONFIRMED A PIECE OF A ROD POKING OUT THE LOWER PART OF MY BLOCK. I NEVER THOUGHT THE ROD BEARING FAILURE WOULD EVER HAPPEN TO ME! IT HAPPENED. I CURRENTLY HAVE NO CAR AND I STILL MAKE PAYMENTS. I HAVE TO GET A RIDE TO WORK WHICH I HATE. BMW SHOULD BE HELD RESPONSIBLE FOR ALL S65 MOTORS THAT HAVE THESE NO CLEARANCE ROD BEARINGS. THIS WAS MY BABY. NOW SHE'LL NEVER BE THE SAME AGAIN.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 11079720,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1521000000000-0400)/",
      "DateComplaintFiled": "/Date(1521177815000-0400)/",
      "VIN": "WBSVA93528E",
      "Component": "AIR BAGS",
      "Summary": "PASSENGER RESTRAINT ERROR KEEPS COMING UP DUE TO FAULT IN SEAT MATS. RECALLED FOR OTHER 3 SERIES VEHICLES, 2008 M3 SHOULD BE INCLUDED IN RECALL.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 11144882,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1541044800000-0400)/",
      "DateComplaintFiled": "/Date(1541170835000-0400)/",
      "VIN": "WBSVA93528E",
      "Component": "ELECTRICAL SYSTEM",
      "Summary": "NHTSA RECALL NUMBER: 17V676  \r\nTHIS RECALL WAS ISSUED OVER A YEAR AGO AND STILL HAVE YET TO BE CONTACTED BY BMW TO RESOLVE THE RECALL OR PROVIDE ANY RECOURSE. WHAT IS THE TYPICAL RESPONSE TIME?",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 11253458,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "Yes",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1567483200000-0400)/",
      "DateComplaintFiled": "/Date(1567656000000-0400)/",
      "VIN": "WBSWD93528P",
      "Component": "ELECTRICAL SYSTEM",
      "Summary": "TL* THE CONTACT OWNS A 2008 BMW M3. THE CONTACT STATED THAT THE VEHICLE WAS PARKED IN REVERSE ON A HILL. THE EMERGENCY BRAKE WAS NOT APPLIED PROPERLY AND THE VEHICLE ROLLED DOWN THE HILL AND CRASHED INTO ANOTHER VEHICLE. THERE WERE NO INJURIES. A POLICE REPORT WAS FILED. THE AIR BAGS DID NOT DEPLOY. THE CONTACT'S VEHICLE SUSTAINED DAMAGES TO THE HOOD, BUMPER, AND FENDER. THE VEHICLE WAS TOWED BY AAA TO AUTOMASTER BMW (3328 SHELBURNE RD, #3, SHELBURNE, VT 05482, (802) 985-1850) WHERE IT WAS DIAGNOSED THAT THE ELECTRICAL SYSTEM NEEDED TO BE REPLACED. THE ELECTRICAL SYSTEM WAS REPLACED; HOWEVER, THE BODY DAMAGE WAS NOT REPAIRED. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 19V472000 (ELECTRICAL SYSTEM) AS A POTENTIAL CAUSE OF THE FAILURE, BUT HE HAD NOT RECEIVED A RECALL NOTICE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND ASSISTED WITH THE REPAIR COST. THE VEHICLE WAS CURRENTLY AT AN INDEPENDENT MECHANIC TO HAVE THE BODY DAMAGE REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 90,000.  *TR*JB",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 11265977,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1568692800000-0400)/",
      "DateComplaintFiled": "/Date(1570145139000-0400)/",
      "VIN": "WBSVA93548E",
      "Component": "ENGINE",
      "Summary": "WHILE DRIVING AT APPROXIMATELY 70MPH ON THE HIGHWAY, CEL CAME ON, CAR WENT INTO LIMP MODE, BEFORE LOSING POWER ALTOGETHER WHILE DRIVING. VEHICLE WOULD NOT TURN BACK ON. REPORT OF ENGINE DAMAGE REQUIRING AN ENTIRE REPLACEMENT.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 11350380,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1596254400000-0400)/",
      "DateComplaintFiled": "/Date(1597931060000-0400)/",
      "VIN": "WBSWD93538P",
      "Component": "FUEL/PROPULSION SYSTEM",
      "Summary": "VISIBLE GASOLINE LEAK FROM THE CHASSIS UNDER THE DRIVER SIDE REAR PASSENGER AREA. STATIONARY INSIDE GARAGE.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10934495,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1481346000000-0500)/",
      "DateComplaintFiled": "/Date(1481448551000-0500)/",
      "VIN": "WBSWD93558P",
      "Component": "ENGINE",
      "Summary": "ROD BEARING FAILURE! TODAY WHILE ENTERING THE FREEWAY I HEARD A LOUD BOOM FOLLOWED BY THE ENGINE TURNING OFF. I TOWED THE CAR HOME AND AFTER INSPECTION I FOUND THE CYLINDER 8 PISTON HAS BLOWN THROUGH THE BLOCK. THE CAR HAS JUST BROKE 100K MILES,HAS ALWAYS BEEN SERVICED ON TIME AND SHOWED NO PRIOR INDICATION OF ANY ISSUES. I HAD THIS CAR IN THE SHOP FOR A CHECK UP FROM BMW'S \"MASTER TECH\" WITH NO NOTES OF ANY NOISES OR ISSUES.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10940151,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1481346000000-0500)/",
      "DateComplaintFiled": "/Date(1483678800000-0500)/",
      "VIN": "WBSWD93578P",
      "Component": "ENGINE",
      "Summary": "ENGINE FAILURE RESULTING IN LOSS OF POWER AT SPEED WHILE DRIVING.  ENGINE FAILED BECAUSE OF ROD BEARING ISSUE WHICH IS WELL KNOWN IN THESE ENGINES.  *TR",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10992606,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "Yes",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1487480400000-0500)/",
      "DateComplaintFiled": "/Date(1496311593000-0400)/",
      "VIN": "WBSWD93528P",
      "Component": "ENGINE",
      "Summary": "I WAS DRIVING MY CAR AT BOUT 1AM ON A CLEAR 45 DEGREE MORNING. I WAS DRIVING AT ABOUT 54 MPH ON A FREEWAY. I HEARD A NOISE COME FROM MY ENGINE, IT SOUND LIKE METAL BEING GRIND. MY VEHICLE THEN SHUT OFF I LOST POWER STEERING CAUSING ME TO RUN INTO A DITCH. WHEN I FINALLY CAME TO A STOP I NOTICED THE VEHICLE WILL NOT RE START. I CALLED A TOW TRUCK. WHEN THE TRUCK MOVED MY CAR I NOTICED A LOT OF ENGINE OIL UNDER THE CAR. I HAD THE TRUCK TOWED TO A BMW MECHANIC. THE MECHANIC TOLD ME \" ONE OF YOUR ROD BEARINGS BROKE SENDING A ROD THROUGH YOUR OIL PAN\". AND I HAVE TINY PIECES OF METAL ALL INSIDE OF MY ENGINE. HE ALSO TOLD ME THAT I WILL NEED A NEW ENGINE.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10947979,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1479963600000-0500)/",
      "DateComplaintFiled": "/Date(1485544341000-0500)/",
      "VIN": "WBSWD93568P",
      "Component": "ENGINE",
      "Summary": "THROTTLE ACTUATOR PROBLEM: IS CAUSED BY AN ENGINEERING DEFECT IN THE ACTUATOR GEARS WHICH DETERIORATE UNDER 60,000 MILES AND CAUSE THE ENGINE TO GO TO \"LIMP\" MODE. ONCE IN LIMP MODE THE ENGINE MAY STALL AND WON'T ACCELERATE AS NORMAL; WHICH WAS MY CASE WHEN IT OCCURRED ON THE HIGHWAY CAUSING A GREAT DANGER TO MYSELF AND SOCIETY.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10970953,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1491451200000-0400)/",
      "DateComplaintFiled": "/Date(1491451200000-0400)/",
      "VIN": "WBSWL93518P",
      "Component": "AIR BAGS",
      "Summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW M3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER AND DEALER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10897013,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1471147200000-0400)/",
      "DateComplaintFiled": "/Date(1471568981000-0400)/",
      "VIN": "WBSWD935X8P",
      "Component": "ENGINE",
      "Summary": "THE 2008 ME HAS THE S65 ENGINE WHICH HAS BEEN HEAVILY REPORTED TO HAVE ROD BEARING FAILURES DUE TO POOR DESIGN OF THE FACTORY ROD BEARINGS. MY CAR ENGINE HAS SEIZED DUE TO THIS AND I AM LOOKING AT FROM BMW $30,000 PLUS IN REPAIRS!! THE NEW BMW M3S HAD AN UPDATED ROD BEARING MATERIAL WHICH PREVENTED IT FROM FAILURE.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10896370,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "Yes",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1463544000000-0400)/",
      "DateComplaintFiled": "/Date(1471376163000-0400)/",
      "VIN": "WBSVA93528E",
      "Component": "ELECTRICAL SYSTEM",
      "Summary": "VEHICLE MILEAGE: 41,706\r\nAFTER RECEIVING AN OIL CHANGE, I PICKED MY CAR UP AT MY LOCAL INDEPENDENT MECHANIC SHOP. WHEN TURNING THE CAR ON I NOTICED A MISFIRE WITH THE ENGINE. I TURNED THE CAR OFF AND ASKED THE SHOP TO TAKE A LOOK. THEY IDENTIFIED A MISFIRE IN CYLINDER #2. AFTER 30 SECONDS OF THE CAR BEING TURNED OFF, SMOKE STARTED POURING OUT OF CYLINDER #2.  AFTER 90 SECONDS OF AGGRESSIVELY SMOKING, THE FIRE PUT ITSELF OUT. IIT WAS FOUND THAT THE COIL PACK FOR CYLINDER #2 CAUGHT FIRE AND FRIED AN UPSTREAM DME CONTROL UNIT AS WELL.\r\nREPAIRS WERE STARTED THE NEXT DAY TO REPLACE ALL 8 COIL PACKS AND THE DME CONTROL UNIT. \r\nFORTUNATELY I WAS NOT DRIVING AND MY FAMILY WAS NOT IN THE CAR. I IMMEDIATELY CONTACTED BMW THROUGH THEIR ONLINE SYSTEM. \r\nAFTER 3 DAYS I CALLED THEIR HELP NUMBER. I THEN WAITED 2 DAYS FOR CONTACT FROM THEM. FINALLY I RECEIVED A PHONE CALL BACK, BY THIS TIME THE CAR WAS REPAIRED BY MY MECHANIC. BMW DENIED MY REQUEST FOR REIMBURSEMENT, STATING THE CAR WAS NOT AT A BMW DEALERSHIP WHEN IT CAUGHT FIRE. AFTER ESCALATING THE CONCERN WITHIN BMW TO THEIR INVESTIGATION TEAM, I WAS REQUESTED TO SUBMIT PHOTOS OF THE BURNT COIL PACK, AND REPAIR RECEIPTS. AFTER 5 WEEKS OF WAITING, THEY CONTACTED ME AND DENIED MY CLAIM AGAIN. WHEN I ASKED FOR THE INVESTIGATION REPORT, THEY STATED THAT NO INVESTIGATION WAS CONDUCTED AND THAT NO REPORT WOULD BE PROVIDED.  I HAVE SINCE FOUND ANOTHER M3 OWNER WITH THE SAME FAILURE ON THE SAME MODEL VEHICLE WITH THE SAME MILEAGE. THE COIL PACK WAS ORIGINAL TO THE CAR, AND HAS NOT BEEN TOUCHED SINCE IT WAS BUILT BY BMW. THIS PART IS NOT LISTED FOR REPLACEMENT IN BMW'S MAINTENANCE SCHEDULE. I NO LONGER FEEL SAFE WITH MY FAMILY IN THE CAR. BMW REFUSES TO REIMBURSE ME FOR THE DAMAGES, NOR DO THEY CLAIM THAT THIS IS A BMW PART CONCERN. IF IT'S NOT A PART PROBLEM, THEN WHAT CAUSED IT TO CATCH FIRE?\r\n",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10903810,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1470283200000-0400)/",
      "DateComplaintFiled": "/Date(1473134400000-0400)/",
      "VIN": "WBSWD93538P",
      "Component": "ELECTRICAL SYSTEM",
      "Summary": "MY BMW HAVE HEADLIGHTS INSULATION FLAKING OFF, THIS IS REALLY SCARY BECAUSE I'M AFRAID TO GET MY CAR GETTING FIRE.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10903812,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1472702400000-0400)/",
      "DateComplaintFiled": "/Date(1473134400000-0400)/",
      "VIN": "WBSWD93538P",
      "Component": "ELECTRONIC STABILITY CONTROL | SERVICE BRAKES | VEHICLE SPEED CONTROL",
      "Summary": "ABS HYDRO UNIT ON E92 M3 2008 JUST FAILED, IT IS A COMMON ISSUE ON ALL BMW CARS, THOUGH PROBLEM IS OVER THE YEAR AND BECAUSE OF POOR SOLDIERING THESE UNIT FAILS, CAUSING BRAKING PROBLEM, CRUISE CONTROL NOT WORKING IRRESPONSIVE, AND STABILITY CONTROL PROBLEMS.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    },
    {
      "ODINumber": 10908714,
      "Manufacturer": "BMW of North America, LLC",
      "Crash": "No",
      "Fire": "No",
      "NumberOfInjured": 0,
      "NumberOfDeaths": 0,
      "DateofIncident": "/Date(1456808400000-0500)/",
      "DateComplaintFiled": "/Date(1474516800000-0400)/",
      "VIN": "WBSWL93508P",
      "Component": "AIR BAGS",
      "Summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW M3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 126V071000 (AIR BAGS); HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
      "ProductType": "VEHICLE",
      "ModelYear": "2008",
      "Make": "BMW",
      "Model": "M3"
    }
  ]
}